{"content": "From Wikipedia, the free encyclopedia Intelligence of machines \"AI\" redirects here. For other uses, see AI (disambiguation) and Artificial intelligence (disambiguation) . Part of a series on Artificial intelligence (AI) Major goals Artificial general intelligence Intelligent agent Recursive self-improvement Planning Computer vision General game playing Knowledge representation Natural language processing Robotics AI safety Approaches Machine learning Symbolic Deep learning Bayesian networks Evolutionary algorithms Hybrid intelligent systems Systems integration Open-source AI data centers Applications Bioinformatics Deepfake Earth sciences Finance Generative AI Art Audio Music Government Healthcare Mental health Industry Software development Translation Military Physics Projects Philosophy AI alignment Artificial consciousness The bitter lesson Chinese room Friendly AI Ethics Existential risk Turing test Uncanny valley Human–AI interaction History Timeline Progress AI winter AI boom AI bubble Controversies Deepfake pornography Taylor Swift deepfake pornography controversy Grok deepfake pornography controversy Google Gemini image generation controversy Pause Giant AI Experiments Removal of Sam Altman from OpenAI Statement on AI Risk Tay (chatbot) Théâtre D'opéra Spatial Voiceverse NFT plagiarism scandal Glossary Glossary v t e Artificial intelligence ( AI ) is the capability of computational systems to perform tasks typically associated with human intelligence , such as learning , reasoning , problem-solving , perception , and decision-making . It is a field of research in computer science that develops and studies methods and software that enable machines to perceive their environment and use learning and intelligence to take actions that maximize their chances of achieving defined goals. [ 1 ] High-profile applications of AI include advanced web search engines (e.g., Google Search ); recommendation systems (used by YouTube , Amazon , and Netflix ); virtual assistant", "sources": [{"url": "https://en.wikipedia.org/wiki/Artificial_intelligence", "source": "DuckDuckGo"}, {"url": "https://www.britannica.com/technology/artificial-intelligence", "source": "DuckDuckGo"}, {"url": "https://www.bbc.com/technology/artificial-intelligence", "source": "DuckDuckGo"}, {"url": "https://www.coursera.org/articles/what-is-artificial-intelligence", "source": "DuckDuckGo"}], "entities": ["Refik Anadol", "General Intelligence? Definition", "Google Search", "Children Encyclopedia", "Taylor Swift", "Artificial Intelligence ChatGPT:", "Khan Academy Sal", "AI? Artificial Intelligence", "Art Audio Music", "Finance Generative AI", "History Timeline Progress", "Experiments Removal", "External Websites National", "Harvard University", "Friendly AI Ethics", "Multi-billionaire Elon Musk", "Military Medical Research", "Industry Software", "London. Now,", "Google Translate: Uses"]}