{"content": "Примеры Здесь приведены несколько примеров использования Nmap, от самых простых до более изощренных. Некоторые реально существующие IP адреса и доменные имена использованны для того, чтобы сделать примеры более конкретными. На их место вы должны подставить адреса/имена из вашей собственной сети. . В то время как сканирование портов некоторой сети не является незаконным, некоторым администраторам сетей может не понравиться своевольное сканирование их сетей и они могут пожаловаться. Для начала постарайтесь получить разрешение. В целях тестирования у вас есть разрешение сканировать scanme.nmap.org . Вы можете использовать сканирование с помощью Nmap, но не тестировать эксплоиты или производить атаки отказа в обслуживании. Для того чтобы не перегружать канал, пожалуйста, не производите более дюжины сканирований этого хоста в день. В случае злоупотребления этим свободным для сканирования хостом, он будет отключен и Nmap выдаст Failed to resolve given hostname/IP: scanme.nmap.org (не могу разрешить данное имя/IP: scanme.nmap.org). Все выше сказанное также относится и к хостам scanme2.nmap.org , scanme3.nmap.org , и так далее, несмотря на то, что эти хосты еще не существуют. nmap -v scanme.nmap.org Этой командой будут просканированы все TCP порты машины scanme.nmap.org . Опция -v активирует вербальный режим. nmap -sS -O scanme.nmap.org/24 Этой командой будет произведено скрытное SYN сканирование всех 255 машин сети « класса C » , в которой расположена машина Scanme. Также будет произведена попытка определения операционной системы на каждом работающем хосте. Из-за SYN сканирования и опции определения ОС данная команда требует привилегий суперпользователя (root). nmap -sV -p 22,53,110,143,4564 198.116.0-255.1-127 Запускает перебор хостов и TCP сканирование первой половины всех (из доступных 255) 8 битных подсетей адресного пространства 198.116 класса B. Также проверяет запущены ли SSH, DNS, POP3 или IMAP с использованием их стандартных портов, а также использует ли какое-ниб", "sources": [{"url": "https://nmap.org/man/ru/man-examples.html", "source": "DuckDuckGo"}, {"url": "https://www.ciksiti.com/ru/chapters/4467-30-nmap-examples--linux-hint", "source": "DuckDuckGo"}, {"url": "https://codeby.net/threads/nmap-uzhe-ne-tot-eti-5-komand-sdelayut-iz-tebya-guru-setevogo-skanirovaniya.85909/", "source": "DuckDuckGo"}], "entities": ["Указывает Nmap", "SSH, DNS, POP3", "Минус: Требует", "Минус: Очень", "Nmap NULL В", "SYN/ACK, ACK). Плюс:", "Из-за SYN", "Примеры Здесь", "Nmap Nmap ARP", "Nmap ARP", "Nmap NSE", "SYN Scan", "SMB В", "UDP. А", "NSE Nmap", "IP? Давай", "NULL, Xmas", "IKE). Сканирование UDP", "Scan Nmap FIN", "TCP Connect"]}