{"content": "nmap как пользоваться Last update – 2026-01-03 — by revWhiteShadow — 6 min read nmap как пользоваться: Полное руководство по сканированию сети в Linux # Сетевое сканирование — фундаментальный навык для системных администраторов, специалистов по кибербезопасности и разработчиков. Nmap (Network Mapper) — это стандарт де-факто для обнаружения хостов, открытых портов и служб в сети. Это мощный инструмент с открытым исходным кодом, который работает в терминале Linux и предоставляет гибкие возможности для аудита безопасности. В этом руководстве вы узнаете, как использовать nmap для эффективного сканирования, начиная с базовых команд и заканчивая продвинутыми техниками, которые применяются в bug bounty программах и security research . Установка и подготовка Nmap # Перед началом работы убедитесь, что у вас установлен Nmap. В большинстве дистрибутивов Linux он доступен в стандартных репозиториях. Установка в Debian/Ubuntu: bash sudo apt update sudo apt install nmap Установка в Arch Linux: bash sudo pacman -S nmap Установка в Fedora: bash sudo dnf install nmap Для проверки установки выполните команду: bash nmap –version Важно: Сканирование сетей, которым вы не принадлежите, без разрешения является незаконным. Всегда получайте явное разрешение перед тестированием целевых систем. Базовые принципы работы и термины # Прежде чем переходить к командам, важно понять основные концепции: Порт: Конечная точка сетевого соединения (например, 80 для HTTP, 443 для HTTPS). Состояние порта: Open (открыт): Приложение принимает соединения. Closed (закрыт): Порт доступен, но нет приложения, которое бы слушало его. Filtered (фильтруется): Файрвол или сетевое устройство блокирует доступ к порту. Хост (Host): Устройство в сети с уникальным IP-адресом. Основные команды и флаги Nmap # 1. Сканирование хостов (Ping Scan) # Если вам нужно быстро проверить, какие устройства находятся в сети, используйте сканирование без портов. Это самый быстрый способ. bash nmap -sn 192.168.1.0/24 -sn : Отключает скани", "sources": [{"url": "https://itsfoss.gitlab.io/blog/nmap/", "source": "DuckDuckGo"}, {"url": "https://habr.com/ru/articles/88064/", "source": "DuckDuckGo"}], "entities": ["Использование Git", "EST Nmap", "Nmap. В", "C3045, C3380,", "Опции_сканирования Цель_сканирования. Допустим", "AirPort Express", "Bug Bounty Workflow", "C5185); Kyocera FS-4020DN", "Running: Linux", "Порт: Конечная", "VxWorks: Apple AirPort", "Важно: Сканирование", "PORT STATE SERVICE", "Nmap. Начало", "Nmap. Синтаксис Nmap", "Apple Airport Extrime.", "T5). Скрипты Nmap", "IP-адресом. Основные", "Борна, Хоттабыч,", "DHCP. Оно"]}