{"content": "m1rko 15 янв 2019 в 18:22 Руководство и шпаргалка по Wireshark Время на прочтение 7 мин Охват и читатели 379K Информационная безопасность * Сетевые технологии * Системное администрирование * Софт Туториал Перевод Автор оригинала: Hacker Target Даже поверхностное знание программы Wireshark и её фильтров на порядок сэкономит время при устранении проблем сетевого или прикладного уровня. Wireshark полезен для многих задач в работе сетевого инженера, специалиста по безопасности или системного администратора. Вот несколько примеров использования: Устранение неполадок сетевого подключения Визуальное отображение потери пакетов Анализ ретрансляции TCP График по пакетам с большой задержкой ответа Исследование сессий прикладного уровня (даже при шифровании с помощью SSL/TLS, см. ниже) Полный просмотр HTTP-сессий, включая все заголовки и данные для запросов и ответов Просмотр сеансов Telnet, просмотр паролей, введённых команд и ответов Просмотр трафика SMTP и POP3, чтение писем Устранение неполадок DHCP с данными на уровне пакетов Изучение трансляций широковещательного DHCP Второй шаг обмена DHCP (DHCP Offer) с адресом и параметрами Клиентский запрос по предложенному адресу Ack от сервера, подтверждающего запрос Извлечение файлов из сессий HTTP Экспорт объектов из HTTP, таких как JavaScript, изображения или даже исполняемые файлы Извлечение файлов из сессий SMB Аналогично опции экспорта HTTP, но извлечение файлов, передаваемых по SMB, протоколу общего доступа к файлам в Windows Обнаружение и проверка вредоносных программ Обнаружение аномального поведения, которое может указывать на вредоносное ПО Поиск необычных доменов или конечных IP Графики ввода-вывода для обнаружения постоянных соединений (маячков) с управляющими серверами Отфильтровка «нормальных» данных и выявление необычных Извлечение больших DNS-ответов и прочих аномалий, которые могут указывать на вредоносное ПО Проверка сканирования портов и других типов сканирования на уязвимости Понимание, какой сетевой трафик пост", "sources": [{"url": "https://habr.com/ru/articles/436226/", "source": "DuckDuckGo"}, {"url": "https://networkguru.ru/wireshark/", "source": "DuckDuckGo"}, {"url": "https://readmag.ru/post/primery-filtrov-wireshark.html", "source": "DuckDuckGo"}], "entities": ["WireShark В", "WireShark? В США", "SMB Аналогично", "MAC Любой", "Wireshark Анализ TCP-пакетов", "Tunneling Protocol", "TCP График", "IP-адреса, Wireshark", "Windows На", "Установка Wireshark Wireshark", "Логическое НЕ", "Подпоследовательность Фильтры Wireshark", "OpenVPN Protocol", "Ubuntu Linux, Centos", "HTTP. В", "Enable Network Name", "Протокол HTTP", "Резолвинг DNS", "Логическое ИЛИ", "MAC-адресу, IP-адресу,"]}