{"content": "AntonRukoleyev 17 мая 2023 в 18:14 Wireshark — подробное руководство по началу использования Уровень сложности Средний Время на прочтение 8 мин Охват и читатели 539K Информационная безопасность * Сетевые технологии * Из песочницы Руководство по анализу трафика сети посредством Wireshark 1. Что такое Wireshark? Логотип программы Wireshark – это широко распространённый инструмент для захвата и анализа сетевого трафика, который активно используется как для образовательных целей, так и для устранения неполадок на компьютере или в сети. Wireshark работает практически со всеми протоколами модели OSI, обладает понятным для обычного пользователя интерфейсом и удобной системой фильтрации данных. Помимо всего этого, программа является кроссплатформенной и поддерживает следующие операционные системы: Windows, Linux, Mac OS X, Solaris, FreeBSD, NetBSD, OpenBSD. В этом руководстве мы рассмотрим основной функционал программы Wireshark, соотнесём её с моделью OSI, научимся анализировать сетевой трафик и обезопасим своё нахождение в глобальной сети Интернет. 2. Как установить Wireshark? Для начала нам необходимо скачать и установить программу Wireshark. Так как программа распространяется под лицензией GNU GPL v2 (т.е. может свободно распространяться), то несложно найти любую версию программы в свободном доступе. В руководстве мы будем использовать функционал более ранней версии программы (1.12.3). Это вызвано тем, что в этой версии сразу встроен протокол SSL, который используется в главе 6. Установка более ранней версии облегчает подготовку к работе с программой, поэтому мы выбрали её. Найти установщик можно на официальном сайте . Дальнейшая установка программы проста – нажимаем «Next» - «Next» - «Next». Установка программы После успешной установки на Вашем рабочем столе появится ярлык Wireshark. Мы можем приступать к рассмотрению функционала! Ярлык программы на рабочем столе 3. Как пользоваться программой Wireshark? Одна из главных возможностей программы – это захват трафика сети.", "sources": [{"url": "https://habr.com/ru/articles/735866/", "source": "DuckDuckGo"}, {"url": "https://blog.skillfactory.ru/chto-takoe-wireshark/", "source": "DuckDuckGo"}, {"url": "https://www.wireshark.org/docs/wsug_html/", "source": "DuckDuckGo"}], "entities": ["Press Ctrl", "IP. Он", "Wireshark. Мы", "Style Description Example", "Wireshark? Для", "Press Launch", "Wireshark С Wireshark", "Википедии. Во", "GNU GPL", "HTTP В", "Wireshark Анализ", "Wireshark? Логотип", "МИФИ От", "Поздравляем! Вы", "OSI. Достаточно", "HTTP. Обзор", "Wireshark? Одна", "Анна Маврина Автор", "Wireshark. Так", "Средний Время"]}