{"content": "Andrey_Biryukov 5 дек 2024 в 04:08 Выявляем атаки на DHCP с помощью Wireshark Время на прочтение 5 мин Охват и читатели 3.8K Блог компании OTUS Сетевые технологии * Информационная безопасность * В сетевом трафике можно найти много всего интересного, главное знать, что искать. С помощью анализатора Wireshark можно находить всевозможные аномалии в трафике, ретрансмиты, некорректные пакеты, вредоносную активность, можно даже прикрутить его к API Virustotal для анализа файлов на вирусы. В рамках этой статьи мы поговорим о том, как с помощью Wireshark выявлять атаки на DHCP: Starvation и Rogue DHCP. Навык анализа подобного трафика позволит эффективнее настроить правила на системах обнаружения вторжений, а также может помочь при расследовании инцидентов и работе команд Red Team. Но для начала давайте посмотрим на то, как работает DHCP с точки зрения сетевого трафика. Далее нам это пригодится при проведении анализа. DHCP под призмой Wireshark Процесс получения IP адреса состоит из четырех шагов (DORA): Discover, Offer, Request, Ack. Давайте посмотрим, как выглядит каждый из этих этапов в дампе трафика. На первом шаге у клиента нет IP адреса, поэтому адрес источника 0.0.0.0, а адресом получателя у нас являются все узлы в сети — 255.255.255.255. На канальном уровне у клиента присутствует его МАС адрес, а в качестве адреса отправителя выступает ff:ff:ff:ff:ff:ff. На втором шаге откликаются DHCP серверы. Здесь у нас уже присутствует предлагаемый сервером IP адрес и опции, в частности маска подсети. На третьем шаге клиент запрашивает конкретный адрес у конкретного DHCP сервера. Соответствующие адреса мы видим в Options. И на завершающем, четвертом шаге мы, что называется, «фиксируем договоренности»: DHCP подтверждает аренду IP адреса. С тем, как выглядит процесс выдачи IP адреса в Wireshark мы разобрались, и теперь самое время посмотреть, как выглядят атаки на DHCP в анализаторе. Два в одном Целью злоумышленника при реализации атак на DHCP является реализация Man in the Midde. ", "sources": [{"url": "https://habr.com/ru/companies/otus/articles/862444/", "source": "DuckDuckGo"}, {"url": "https://vk.com/@greyteam-obnaruzhenie-setevyh-atak-s-pomoschu-wireshark", "source": "DuckDuckGo"}], "entities": ["DHCP Starvation,", "DHCP Discover. Наличие", "Options. И", "Wireshark: С", "Discover, Offer, Request,", "Rogue DHCP. Навык", "DHCP. Один", "Wireshark: Подобно TCP,", "OTUS Сетевые", "TCP SYN", "Wireshark. Выявление", "Red Team. Но", "Wireshark: TCP", "Изучаем DHCP", "Wireshark: Во", "DHCP: Starvation", "TCP Half-Open Scan:", "Wireshark: Сканирование IP-протокола", "ICMP Вот", "Ack. Давайте"]}