{"content": "Windows x64 Installer Windows Arm64 Installer Windows x64 PortableApps® macOS Universal Disk Image Ubuntu Source Code\n\nМатериал из wireshark.wiki Введение Wireshark является самым популярным в мире анализатором сетевых протоколов. Но новичкам обширный функционал программы может показаться запутанным. Этот сайт предназначен для всех, кто использует Wireshark. Программа стала со временем очень сложной, поэтому на данном сайте невозможно рассказать о ней абсолютно все. Однако здесь описаны все основные и некоторые продвинутые функции Wireshark. С помощью размещенных здесь материалов можно научиться устанавливать Wireshark, пользоваться основными элементами графического интерфейса и узнать о некоторых продвинутых функциях, обнаружить которые новичку достаточно сложно. Информация с сайта поможет избежать проблем, с которыми часто сталкиваются новые, а иногда даже и опытные, пользователи Wireshark. Использование Wireshark подразумевает, что инженер понимает принципы работы сетевых протоколов. Типографские соглашения Стиль Описание Пример Курсив Имена файлов, имена папок и расширения C:\\Development\\wireshark Моноширинный шрифт Команды, флаги и переменные окружения CMake’s -G option Жирный моноширинный шрифт Команды, которые должен выполнить пользователь Run cmake -G Ninja КНОПКА Кнопки в диалоговых окнах и окнах программы Нажмите на кнопку ПУСК для запуска автомобиля КЛАВИША 1 + КЛАВИША 2 Комбинации клавиш Нажмите Ctrl + ↓ , чтобы перейти к следующему пакету Элемент меню Элемент меню В основном меню перейдите в Файл → Печать... , чтобы выполнить печать Предостережения Предупреждение Возможна потеря данных Осторожно Действуйте осторожно Важно Читайте инструкцию Полезно Совет, полезный для ежедневной работы с Wireshark Неочевидный нюанс Распространенная ошибка и (или) нюанс, который может быть неочевидным Онлайн-курс по Wireshark На углубленном курсе \" Архитектура современных компьютерных сетей \" вы с нуля научитесь работать с Wireshark и «под микроскопом» изучите работу сет", "sources": [{"url": "https://www.wireshark.org/", "source": "DuckDuckGo"}, {"url": "https://wireshark.wiki/wiki/%D0%9F%D1%80%D0%B5%D0%B4%D0%B8%D1%81%D0%BB%D0%BE%D0%B2%D0%B8%D0%B5", "source": "DuckDuckGo"}], "entities": ["C:\\Development\\wireshark Моноширинный", "Wireshark. Программа", "Дмитрий Анатольевич, ИНН", "Стиль Описание Пример", "Wireshark Неочевидный", "Ubuntu Source Code", "Полезно Совет,", "Важно Читайте", "Wireshark. ИП Скоромнов", "Wireshark. С", "Wireshark На", "Universal Disk Image", "Installer Windows Arm64", "Ninja КНОПКА Кнопки", "Wireshark. Использование Wireshark", "Нажмите Ctrl", "Оболочка Bourne,", "Курсив Имена", "Предостережения Предупреждение Возможна", "Осторожно Действуйте"]}