{"content": "1.4. A Brief History Of Wireshark Prev Chapter 1. Introduction Next 1.4. A Brief History Of Wireshark In late 1997 Gerald Combs needed a tool for tracking down network problems and wanted to learn more about networking so he started writing Ethereal (the original name of the Wireshark project) as a way to solve both problems. Ethereal was initially released after several pauses in development in July 1998 as version 0.2.0. Within days patches, bug reports, and words of encouragement started arriving and Ethereal was on its way to success. Not long after that Gilbert Ramirez saw its potential and contributed a low-level dissector to it. In October, 1998 Guy Harris was looking for something better than tcpview so he started applying patches and contributing dissectors to Ethereal. In late 1998 Richard Sharpe, who was giving TCP/IP courses, saw its potential on such courses and started looking at it to see if it supported the protocols he needed. While it didn’t at that point new protocols could be easily added. So he started contributing dissectors and contributing patches. The list of people who have contributed to the project has become very long since then, and almost all of them started with a protocol that they needed that Wireshark did not already handle. So they copied an existing dissector and contributed the code back to the team. In 2006 the project moved house and re-emerged under a new name: Wireshark. In 2008, after ten years of development, Wireshark finally arrived at version 1.0. This release was the first deemed complete, with the minimum features implemented. Its release coincided with the first Wireshark Developer and User Conference, called Sharkfest. In 2015 Wireshark 2.0 was released, which featured a new user interface. In 2023 Wireshark moved to the Wireshark Foundation , a nonprofit corporation that operates under section 501(c)(3) of the U.S. tax code. The foundation provides the project’s infrastructure, hosts SharkFest , our developer and u", "sources": [{"url": "https://www.wireshark.org/docs/wsug_html_chunked/ChIntroHistory", "source": "DuckDuckGo"}, {"url": "https://ru.wikipedia.org/wiki/Wireshark", "source": "DuckDuckGo"}, {"url": "https://progler.ru/blog/istoriya-wireshark", "source": "DuckDuckGo"}, {"url": "https://www.geeksforgeeks.org/ethical-hacking/history-of-wireshark/", "source": "DuckDuckGo"}, {"url": "https://wireshark.wiki/wiki/%D0%93%D0%BB%D0%B0%D0%B2%D0%B0_1._%D0%92%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5", "source": "DuckDuckGo"}], "entities": ["Дмитрий Анатольевич, ИНН", "Wireshark: Protocol Hierarchy,", "Wiki Официальная", "Introduction Next", "Джеральдом Комбсом. В", "Credentialed Vulnerability Scan?", "Computer Networks", "WATCH, PERL-SNMP-Net-Cisco", "HTTP. Ниже", "Wireshark На", "Scanning Networks What", "LAN), Bluetooth, USB", "Engineering Method", "Information Gathering Tools", "Conclusion: Wireshark", "Wireshark Micropross", "Wireshark Foundation", "Разработчик The Wireshark", "Wireshark? Wireshark", "Ultra Network WinDump"]}