{"content": "The Library of Congress Homepage Featured Items 2025 National Film Registry Library of Congress Names 25 Films to the National Film Registry for Preservation. Library of Congress Winter-Spring 2026 Concert Season Concerts from the Library of Congress launches a yearlong America 250 celebration highlighting the music that defines our nation. Library of Congress Acquires “Wizard of Oz” Musical Sketches To Add to the Harold Arlen Collection Collection Includes Handwritten Music and Lyric Sketches Showing Creative Process Behind Iconic Film, Along with Letters and Artwork. Thursday Night Fun & Programs Live! at the Library features evening engagement in a gorgeous setting. Congress.gov Track bills on the official site for U.S. federal legislative information. Trending Top Searches: World War II Newspapers Veterans Civil War Constitution Civil Rights Watch Serving Congress and the American People Blog Polar Plunge: An Exploration of Antarctic Publishing Magazine Forging Bonds 25 Years of the Veterans History Project News Get the Latest News from the Library of Congress Events Our Calendar of Upcoming Events, In-Person & Virtual Exhibitions Explore Library Exhibitions in Person & Online Blog Winter Reflections with Primary Sources Your Library Use the largest library in the world online or in person! More about the Library . Plan Your Visit Research Centers Ask a Librarian Free to Use and Reuse: Clocks & Calendars Time keeping devices in many forms appear among the clocks & calendars in this set, dating back to the 1500s. All pictures are from the Prints & Photographs Division unless otherwise credited. Browse more content that is free to use and reuse Street clock in Seattle, Washington, which was known as the \"City of Clocks.\" Photo by Carol Highsmith, around 2000. \"Philadelphia clubs at home.\" Poster with baseball game dates, 1915 Aztec calendar stone, now called sun stone. Photo by William Henry Jackson, around 1890. Draco volvelle used to connect dates with the the m", "sources": [{"url": "https://www.loc.gov/", "source": "DuckDuckGo"}, {"url": "https://ru.wikipedia.org/wiki/%D0%91%D0%B8%D0%B1%D0%BB%D0%B8%D0%BE%D1%82%D0%B5%D0%BA%D0%B0_%D0%9A%D0%BE%D0%BD%D0%B3%D1%80%D0%B5%D1%81%D1%81%D0%B0", "source": "DuckDuckGo"}, {"url": "https://www.read.gov/", "source": "DuckDuckGo"}], "entities": ["Juana Medina. This", "Библиотеку Конгресса", "Вашингтон Основана", "National Library Service", "Print Disabled", "Book Affiliate", "Virtual Exhibitions Explore", "Theodor Horydczak,", "Caesarium.\" Ingolstadt,", "John Margolies,", "Greenfield Village Henry", "Rural Communities", "США Джон Адамс", "W.P. Kloster,", "Preservation. Library", "American People Blog", "Upcoming Events, In-Person", "Library Exhibitions", "Trending Top Searches:", "Congress Center"]}