{"content": "Цивилизация Древнего мира • Средиземноморье Древняя Греция Парфенон , Афинский Акрополь Другие названия Эллада • экзотопонимы — Graecia Время конец III—II тыс. — 30 г. до н. э. • периодизация — I Крито-микенская цивилизация (конец III—II тыс. до н. э.) — II Полисный период (XI—IV вв. до н. э.) Локализация Средиземноморье • колыбель — юг Балканского полуострова Население Эллины • осн. этногенез — Эллины Язык древнегреческий • письменность — греческий алфавит Религия древнегреческая религия Медиафайлы на Викискладе История Греции Неолитическая Греция Эгейская цивилизация Западноанатолийская цивилизация Минойская цивилизация Кикладская цивилизация Элладская цивилизация Микенская цивилизация Древняя Греция Тёмные века Архаический период Классический период Эллинистический период Римская Греция Средние века Византийская империя Франкократия Раннее Новое время Венецианские колонии Туркократия Архипелагское великое княжество Французские Ионические острова [англ.] Республика Семи Островов Французское правление [англ.] Ионическая республика Современная история Война за независимость Первая республика Королевство Греция Национальный раскол Вторая республика Режим 4 августа Вторая Мировая война Греческое государство Свободная Греция [англ.] Гражданская война Хунта Третья республика Вступление в ЕС [англ.] Тематические статьи История Военная история Конституционная история [англ.] Экономическая история [англ.] Имя Культура География Портал «Греция» Дре́вняя Гре́ция (Античная Греция [ 1 ] ; др.-греч. Ἑλλάς — Элла́да) — общее название территорий городов-государств ( полисов ), население которых составляли в основном древнегреческие племена: эолийцы , ахейцы , ионийцы и дорийцы . Этническая карта Греции оставалась однородной и практически не изменялась на протяжении всей античной эпохи [ 2 ] . В территории, которые входят в понятие «Древняя Греция», Элла́да , учёные включают места расселения древних греков — эллинов в период греческой колонизации , который начинается с рубежа III—", "sources": [{"url": "https://ru.wikipedia.org/wiki/%D0%94%D1%80%D0%B5%D0%B2%D0%BD%D1%8F%D1%8F_%D0%93%D1%80%D0%B5%D1%86%D0%B8%D1%8F", "source": "DuckDuckGo"}, {"url": "https://www.worldhistory.org/trans/ru/1-119/", "source": "DuckDuckGo"}, {"url": "https://bigenc.ru/c/drevniaia-gretsiia-f1c75e", "source": "DuckDuckGo"}, {"url": "https://globhistory.org/ru/article/greciya/drevnyaya_greciya", "source": "DuckDuckGo"}], "entities": ["Республика Семи Островов", "Имя Культура География", "Туркократия Архипелагское", "Введение Древняя Греция", "Северную Грецию, Среднюю", "Анатолии. Эти", "Вторая Мировая", "Мифический Девкалион,", "Северной Греции,", "Северной Греции", "Греции. Темные", "Эсхила, Софокла", "Македония, Сескло,", "Древнюю Грецию", "Сократ, Платон", "Греция Области", "Малой Азии,", "Левкиппом. Но", "Дуная. Самоназвание", "Свободная Греция"]}