{"content": "Биография Квентин Тарантино (Quentin Tarantino) — американский режиссер, сценарист и актер. Он является одним из наиболее ярких представителей кинематографического постмодернизма. Фильмы Тарантино не оставляют равнодушными и вызывают шквал критики, волну восторга либо немой шок. Детство и юность Квентин Джером Тарантино родился 27 марта 1963 года в Ноксвилле. Его мать Конни в 15 лет вышла замуж за музыканта Тони Тарантино, чтобы обрести желанную независимость, но отношения не сложились. Женщина узнала о беременности уже после расставания с мужем. Квентин никогда не пытался найти отца. Когда ребенку исполнилось 2 года, мать увезла его в Торранс (Лос-Анджелес, США), где и прошло детство будущей знаменитости. Вскоре Конни снова вышла замуж за музыканта. Тот усыновил мальчика и дал ему свою фамилию, но через 6 лет и этот брак распался. Позднее Квентин вернул фамилию биологического отца, потому что та была благозвучней и больше подходила для актерской работы. Тони объявился через 30 лет, когда сын стал богатым и знаменитым. Как прошла встреча, да и была ли она, Квентин ни с кем не делился. Он вообще уверен, что Тарантино-старший пошел по его стопам (отец снимает малоизвестные фильмы и снимается в них сам) только благодаря фамилии, которая у всех на слуху. Квентин Тарантино в молодости / Фото: @Cinematographico Тарантино посещал младшую школу. Режиссер признается, что школа его угнетала — он ненавидел занятия. Такая болезнь, как дислексия, затрудняла ему чтение и запоминание информации, поэтому математика, правописание и другие предметы давались с трудом. К тому же в 12–13 лет Квентин еще не умел кататься на велосипеде и плавать, за что сверстники смеялись над ним. Мать Квентина занялась фармакологией, сделала удачную карьеру и построила новый дом. Большую часть времени женщина проводила на работе, а мальчик часами сидел у телевизора, просматривая сериалы. Тарантино часто прогуливал уроки. В 15 лет подросток бросил учебу и устроился билетером в кинотеатр. По вечерам он за", "sources": [{"url": "https://24smi.org/celebrity/1301-kventin-tarantino.html", "source": "DuckDuckGo"}, {"url": "https://stuki-druki.com/authors/Tarantino.php", "source": "DuckDuckGo"}], "entities": ["Квентин Джером Тарантино", "Билла. Фильм", "Харви Кейтель", "Джон Траволта", "Джорджу Клуни", "Вскоре Конни", "Майкл Мэдсен", "Сэмюэл Л. Джексон", "Getty Images Квентин", "Позднее Квентин", "Тони Тарантино. Конни", "Тони Тарантино,", "Сальму Хайек", "Карьеру Тарантино", "Ноксвилле. Его", "Когда Квентину", "Голливуда. За", "Уильяма Фолкнера. Квентин", "Позже Кве", "Total Film"]}