{"content": "Главная / Биографии Мартин Скорсезе Martin Scorsese Род деятельности режиссер , сценарист , продюсер Дата рождения 17 ноября 1942 года Возраст 83 года Биография Мартин Скорсезе — американский кинорежиссер, сценарист, продюсер и актер, лауреат премии «Оскар» как лучший режиссер за фильм «Отступники». Детство, родители, образование Начало карьеры 1970–1980-е: «Таксист», «Бешеный бык» 1990–2000-е: «Славные парни», «Банды Нью-Йорка», «Отступники» 2010-е: «Волк с Уолл-стрит», «Ирландец» Документальное кино и другие проекты Личная жизнь, жены, дети Награды Избранная фильмография Мартина Скорсезе Детство, родители, образование Мартин Скорсезе в детстве (Фото: из личного архива) Мартин Скорсезе родился 17 ноября 1942 года в Нью-Йорке. Его родители, Чарльз и Кэтрин Скорсезе, родились в семьях выходцев с Сицилии [1] . Кэтрин Скорсезе (урожденная Каппа, 1912–1997) почти 40 лет проработала швеей на фабрике. Впоследствии не раз появлялась в фильмах сына, например, в ленте «Славные парни» она сыграла роль матери Томми, героя Джо Пеши. Чарльз Скорсезе (1913–1993) также работал на швейной фабрике гладильщиком и позже играл небольшие роли в фильмах сына. Будущий режиссер рос в Маленькой Италии — районе Нью-Йорка, где жили итальянские иммигранты. В те годы в районе часто случались перестрелки [2] . Именно в Маленькой Италии будет происходить действие многих фильмов Скорсезе. С детства он болел астмой [3] . Из-за слабого здоровья Скорсезе много времени проводил дома, зато по выходным родители часто водили его в кино. Скорсезе учился в католической школе и готовился стать священником [4] . Однако в итоге выбрал кино и в 1960 году поступил в Колледж искусств и науки Нью-Йоркского университета, получив спустя четыре года степень бакалавра искусств. В 1966 году окончил магистратуру в Школе педагогики Нью-Йоркского университета. Начало карьеры Мартин Скорсезе в молодости (Фото: Fairchild Archive / Penske Media / Getty Images) Первые короткометражные фильмы Скорсезе начал снимать в студенче", "sources": [{"url": "https://www.rbc.ru/person/65e0a4359a79478646bfd5a7", "source": "DuckDuckGo"}, {"url": "https://kinofilmpro.ru/filmografiya/martin-skorseze", "source": "DuckDuckGo"}], "entities": ["Товарный Вагон». В", "Роберт Де Ниро.", "Чарльз Скорсезе", "Скорсезе. С", "Columbia Pictures Corporation)", "Сейчас Мартин Скорсезе", "Fairchild Archive", "University College", "Мюррей». Начинающий", "Фильмография Скорсезе", "Винсент Лобрутто,", "Биография Мартин Скорсезе", "Скорпион Место", "Хайза. Но", "Доменику. В", "Нью-Йорк. Родители Мартина", "Сначала Мартин", "Getty Images) Первые", "New York, New", "Хелен Моррис,"]}