{"content": "Чеченская ОПГ (до 1995 г) Этнические группировки в Москве Чеченская ОПГ в Москве В настоящее время преступное сообщество, более известное среди населения как \"чеченская община\", насчитывает в своих рядах около 3 тысяч человек, из которых в короткий срок порядка 200 членов может быть сформировано хорошо вооруженное боевое подразделение. При оценках степени влияния и опасности чеченской ОПГ следует также учитывать возможности и практику этапирования с территории Чечни мобильных групп боевиков для выполнения конкретных преступных действий. Из этнических ОПГ чеченское было одним из первых, которое под влиянием внешних и внутренних факторов приобрело к 1987 году характер организованного сообщества с жестким централизованным управлением. В 1988 году чеченская ОПГ под \"общим руководством\" лидеров общины (М. Атлангериева - \"Руслан\", Л. Альтмирова - \"Лечо-Лысый\", Х-А. Нухаева и Н.Сулейманова - \"Хоза\"), проведя серию \"разборок\", оттеснила наиболее влиятельные \"местные\" ОПГ (\"люберецкая\", \"солнцевская\", \"балашихинская\") и заняла доминирующее положение. Однако, такая тактика в стратегическом плане ведет, как известно, к \"проигрышу\", так как на преступные деяния сообщества обращается общественное мнение населения не только региона, но и страны в целом, что в конечном итоге буквально заставляет правоохранительные органы принимать \"решительные меры\". К тому же не последнюю роль по формированию резко негативного отношения к чеченской ОПГ в частности, как и к \"чеченской проблеме\" в целом, сыграла позиция руководства Чечни, занявшего откровенно антироссийскую позицию. В итоге, в 1991 году все перечисленные лидеры были арестованы, произошел распад единого преступного сообщества на отдельные группы, во главе которых встали собственные лидеры. Последовавшие вскоре попытки таких лидеров, как М. Таларов (\"Старик\") и его брат В. Таларов (\"Веха\") объединить группировки к успеху не привели. Объясняется это не только противодействием со стороны правоохранительных органов, но и тем, что \"Стари", "sources": [{"url": "https://flb.ru/info_mob/32209.html", "source": "DuckDuckGo"}, {"url": "https://yandex.ru/video/preview/12870227124121176732", "source": "DuckDuckGo"}], "entities": ["Чеченской Республике,", "Банк\", Б.Коммунистическая,", "Грозный. Однако,", "М.Таларов. Опорные", "ОПГ Коммерческие", "Москве Чеченская ОПГ", "Профсоюзная, Д.78;", "Мэри ПоппИИнс", "Мечиславом YouTube", "Мечиславом Как", "Москве В", "Чеченская ОПГ", "Альтемиров, М. Атлангериев,", "Х-А. Нухаева"]}