{"content": "Запрос «Средневековье» перенаправляется сюда; см. также другие значения . У этого термина существуют и другие значения, см. Средние века (значения) . Миниатюра из средневековой рукописи Сре́дние века́ , также Средневеко́вье — принятое в современной исторической науке обозначение периода истории преимущественно Европы и Ближнего Востока , следующего после Античности и предшествующего Новому времени . Средние века изучает научная историческая дисциплина медиевистика [ 1 ] . Мировое Средневековье в целом в западной историографии именуют постклассическим периодом . В современной науке преобладает периодизация Средних веков начиная от падения Западной Римской империи в 476 году и заканчивая рубежом XV—XVI века, с начала эпохи Великих географических открытий , которые ознаменовали переход от мировой истории к общепланетарной. Окончание Средних веков учёными связывается также с такими явлениями, как становление в большинстве европейских стран Европы единых национальных государств , превращение Возрождения в общеевропейское культурное явление, начало Реформации и рост капиталистических отношений. Сторонники этой датировки период с XVI по XVIII век называют Ранним Новым временем . В науке существуют и другие датировки эпохи Средних веков, которые зачастую обусловлены традициями той или иной национальной историографии [ 1 ] . В рамках Средних веков историки выделяют раннее Средневековье (V—XI века; период до середины XIII века, когда Европа сталкивается с арабскими завоеваниями , на Западе часто называется позднеантичным), высокое (классическое или центральное) Средневековье (XII — середина XIV века) и позднее Средневековье (середина XIV — конец XV века). Конец раннего Средневековья обычно связывается с Первым крестовым походом , конец высокого Средневековья — с началом Столетней войны 1337—1453 годов и « Чёрной смерти » в 1348 году; эти события знаменуют собой апогей так называемого кризиса XIV века. Социально-экономическое, политическое и отчасти культурное наполнение терми", "sources": [{"url": "https://ru.wikipedia.org/wiki/%D0%A1%D1%80%D0%B5%D0%B4%D0%BD%D0%B8%D0%B5_%D0%B2%D0%B5%D0%BA%D0%B0", "source": "DuckDuckGo"}, {"url": "https://old.bigenc.ru/world_history/text/4161520", "source": "DuckDuckGo"}, {"url": "https://dic.academic.ru/dic.nsf/ruwiki/2548", "source": "DuckDuckGo"}, {"url": "https://travel-in-time.org/puteshestviya-vo-vremeni/chto-takoe-srednie-veka-istoriya-mifyi-i-pereosmyislenie-epohi-mezhdu-antichnostyu-i-novyim-vremenem/", "source": "DuckDuckGo"}, {"url": "https://news.rambler.ru/tech/55931544-kogda-nachalis-i-zakonchilis-srednie-veka/", "source": "DuckDuckGo"}], "entities": ["Ромул Август", "Разграбление Рима", "Падение Западной Империи", "Священная Римская", "Жанна Д'Арк", "Падение Западной Римской", "Западной Римской", "СРЕ́ДНИЕ ВЕКА́ Рубрика", "Ромула Августа", "Зап. Рим.", "Me­dium Aevum,", "Middle Ages,", "Pavlo По", "Римской. На", "Филиппов СРЕ́ДНИЕ ВЕКА́,", "Восточном Средиземноморье", "Европе. Франки", "Средневековье. Открытие Америки", "Ранним Новым", "Северная Африка"]}