{"content": "Главная / Биографии Стивен Спилберг Steven Spielberg Род деятельности режиссер Дата рождения 18 декабря 1946 года Возраст 79 лет Биография Стивен Спилберг — американский режиссер, продюсер и сценарист, обладатель многочисленных кинонаград, в том числе трех премий «Оскар», один из самых известных режиссеров Голливуда. Детство и молодость Карьера режиссера Личная жизнь и дети Состояние Фильмография: лучшие фильмы Стивена Спилберга Детство и молодость Стивен Спилберг в детстве (Фото: из личного архива) Стивен Аллан Спилберг родился в городе Цинциннати, штат Огайо, США. Его отец Арнольд Спилберг работал инженером, мать Лея Познер была профессиональной пианисткой, впоследствии открыла свой ресторан. Оба родителя происходили из еврейских семей, уехавших из Российской Империи. Во время Второй мировой войны отец Спилберга был радистом, в дальнейшем работал в компаниях RCA, General Electric, был одним из изобретателей мини-компьютеров GE-225 в конце 1950-х. По воспоминаниям режиссера, тема Второй мировой войны постоянно присутствовала в разговорах родителей, поэтому он стал «абсолютно одержим» ею. Спилберг — старший ребенок в семье и единственный сын. У режиссера есть три младшие сестры: Энн Спилберг — кинопродюсер и сценарист; она является соавтором сценария к фильму «Большой» (1988) с Томом Хэнксом в главной роли; Сью Спилберг — специалист по маркетингу; Нэнси Спилберг — продюсер независимого кино. В детстве будущий режиссер жил в Аризоне, потом семья переехала в Калифорнию. В подростковом возрасте Спилберг узнал , что у его матери роман с Берни Адлером, близким другом его отца. В 1965 году его родители развелись, и через год мать вышла замуж за Адлера. После развода родителей Спилберг переехал к отцу, а его сестры остались жить с матерью. В 2022 году Спилберг выпустил фильм «Фабельманы», основанный на его детских воспоминаниях. История с романом матери и последующим разводом родителей нашла отражение в картине. Стивен Спилберг в молодости (Фото: из личного архива) После ш", "sources": [{"url": "https://www.rbc.ru/person/617fcf4b9a7947682883343c", "source": "DuckDuckGo"}, {"url": "https://www.mentoday.ru/heroes/movies-heroes/biografiya-stivena-spilberga-samogo-uspeshnogo-v-istorii-kino-rejissera/", "source": "DuckDuckGo"}], "entities": ["Голливуда. Детство", "Сам Спилберг", "Томом Хэнксом", "Сью Спилберг", "Нэнси Спилберг", "Getty Images) В", "Стивен Спилберг", "Джорджем Лукасом", "Берни Адлером,", "Энн Спилберг", "Биографии Стивен Спилберг", "Адлера. После", "Лея Познер", "Состояние Фильмография:", "Джонс: В", "Steven Spielberg Род", "Эмили Блант,", "RCA, General Electric,", "Hulton Archive", "Индиану Джонса,"]}