{"content": "From Wikipedia, the free encyclopedia American filmmaker (born 1946) \"Spielberg\" redirects here. For other uses, see Spielberg (disambiguation) . Steven Spielberg KBE Spielberg in 2023 Born Steven Allan Spielberg ( 1946-12-18 ) December 18, 1946 (age 79) Cincinnati , Ohio, US Education California State University, Long Beach ( BA ) Occupations Film director producer screenwriter Years active 1959–present Works Filmography unrealized projects Spouses Amy Irving ​ ​ ( m. 1985; div. 1989) ​ Kate Capshaw ​ ( m. 1991) ​ Children 6, including Sasha , Sawyer , and Destry Father Arnold Spielberg Relatives Anne Spielberg (sister) Nancy Spielberg (sister) Jessica Capshaw (stepdaughter) Awards Full list Steven Spielberg's voice At the premiere of Music by John Williams Recorded October 2024 Signature This article is part of a series about Steven Spielberg Personal Arnold Spielberg (father) Anne Spielberg (sister) Nancy Spielberg (sister) Amy Irving (first wife) Kate Capshaw (second wife) Destry Spielberg (daughter) Sasha Spielberg (daughter) Filmography Firelight Duel The Sugarland Express Jaws Close Encounters of the Third Kind 1941 Raiders of the Lost Ark E.T. the Extra-Terrestrial Twilight Zone: The Movie Indiana Jones and the Temple of Doom The Color Purple Empire of the Sun Indiana Jones and the Last Crusade Always Hook Jurassic Park Schindler's List The Lost World: Jurassic Park Amistad Saving Private Ryan A.I. Artificial Intelligence Minority Report Catch Me If You Can The Terminal War of the Worlds Munich Indiana Jones and the Kingdom of the Crystal Skull The Adventures of Tintin War Horse Lincoln Bridge of Spies The BFG The Post Ready Player One West Side Story The Fabelmans Disclosure Day Television \" L.A. 2017 \" Amazing Stories High Incident Invasion America Video games The Dig Steven Spielberg's Director's Chair Medal of Honor Medal of Honor: Allied Assault Boom Blox Boom Blox Bash Party Characters E.T. Elliott Taylor Sammy Fabelman Film studios Amblin Partners Amb", "sources": [{"url": "https://en.wikipedia.org/wiki/Steven_Spielberg", "source": "DuckDuckGo"}, {"url": "https://www.kinopoisk.ru/name/22260/", "source": "DuckDuckGo"}, {"url": "https://www.fair.org.ua/ru/spilberg-biografiya-dosyagnennya-osobyste-zhyttya/", "source": "DuckDuckGo"}, {"url": "https://ru.euronews.com/culture/2026/02/02/steven-spielberg-confirms-egot-status-after-winning-his-first-grammy", "source": "DuckDuckGo"}], "entities": ["Зміст Toggle Стивен", "Best Director", "Jessica Capshaw", "Report Catch Me", "Crystal Skull The", "Awards Full", "The Adventures", "Artificial Intelligence Minority", "Honor: Allied Assault", "Shoah Foundation", "Tony Award", "The Dial Of", "Third Kind", "Ледженд, Дженнифер Хадсон,", "The Color Purple", "A.I. Artificial Intelligence", "Incident Invasion America", "Schindler List", "Signature This", "World War II"]}