{"content": "О кино Стивен Спилберг мечтал с детства. Получив в подарок 8‑миллиметровую камеру, он научился снимать и монтировать короткие ролики. Например, крушение игрушечных поездов: отец запретил сталкивать их по-настоящему и мальчик создал эффект аварии с помощью склейки. В 13 лет Стивен уже победил в юношеском конкурсе любительских фильмов, создав 40-минутную картину о войне «Побег в никуда». А в 1969 году представителям Universal Pictures так понравилась его короткометражка Amblin, что они подписали контракт с начинающим режиссёром (впоследствии этот фильм дал название собственной студии Спилберга). Потом он создал низкобюджетные «Дуэль» и «Шугарлендский экспресс». Но самое интересное началось в середине семидесятых, когда режиссёр буквально перевернул кинематограф. 1. Челюсти Jaws США, 1975 год. Ужасы, триллер. Длительность: 124 минуты. IMDb: 8,0. Шериф местной полиции обнаруживает на берегу останки девушки, растерзанной огромной белой акулой . Число жертв с каждым днём растёт, но руководство города не решается оповестить жителей об опасности. Тогда шериф объединяется с охотником на акул и океанологом. Вместе они хотят выловить чудовище. Можно сказать, что «Челюсти» Спилберга изменили понятие «блокбастер». Теперь это самостоятельный жанр фильмов, которые по самой своей задумке должны вызывать ажиотаж и собирать огромную кассу. При бюджете всего в 7 млн в прокате США картина заработала более 200. После чего на режиссёра буквально посыпались предложения о сотрудничестве. Смотреть в iTunes → Смотреть в Google Play → 2. Близкие контакты третьей степени Close Encounters of the Third Kind США, 1977 год. Фантастика, приключения. Длительность: 138 минут. IMDb: 7,7. В разных точках земли в разное время происходят аномальные явления: появляются пустые самолёты, пропавшие ещё в сороковые годы, а корабли переносятся в пустыню. Учёные подозревают, что во всём виноваты инопланетяне. В контакт с НЛО входят многие простые люди, в их числе и электрик Рой Нэри, у которого потом начинаются", "sources": [{"url": "https://lifehacker.ru/steven-spielberg-films/", "source": "DuckDuckGo"}, {"url": "https://ru.wikipedia.org/wiki/%D0%A4%D0%B8%D0%BB%D1%8C%D0%BC%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D1%8F_%D0%A1%D1%82%D0%B8%D0%B2%D0%B5%D0%BD%D0%B0_%D0%A1%D0%BF%D0%B8%D0%BB%D0%B1%D0%B5%D1%80%D0%B3%D0%B0", "source": "DuckDuckGo"}, {"url": "https://dzen.ru/a/YZvPnbgiYSdpw2hS", "source": "DuckDuckGo"}], "entities": ["Всегда Да Да", "Питера Джексона", "Автопоток Да Да", "Google Play", "Луны Да Ковбои", "Роберту Земекису, Майклу", "Джеймсе Бонде. Но", "Инопланетянин E.T. The", "Индиана Джонс", "Капитан Крюк Да", "Спилберга). Потом", "Дока Сэвэджа,", "Каспер Да Балто", "Интернэшнл Да", "Поиск Оскара Да", "Third Kind США,", "Линкольн Да Да", "Трансформеры: Восхождение Звероботов", "Индиана Джонс: В", "Папа Да Назад"]}