{"content": "Black Flag (с англ. — «Чёрный флаг») — американская панк-рок-группа, основанная в 1976 году в Хермоса-Бич (Калифорния) под названием Panic гитаристом Грегом Гинном, ставшим автором большинства её песен и единственным бессменным участником, и вокалистом Китом Моррисом. Являясь одной из первых хардкор-панк-групп, она также выступила одним из пионеров пост-хардкора. После распада в 1986 году Black Flag воссоединялись в 2003, а затем в 2013 году. Второе воссоединение продлилось больше года, и за это время группа выпустила свой первый студийный альбом почти за 30 лет — What The… (2013). Группа объявила о своём третьем воссоединении в январе 2019 года.\nВ звучании Black Flag грубая простота Ramones сочеталась с атональным гитарным соло в стиле, близком к соло ведущего гитариста New York Dolls Джонни Сандерса, а в более поздние годы — с частыми сменами темпа. Тексты в основном писал Гинн, и, как и другие панк-группы конца 1970-х — начала 1980-х, Black Flag выражали антиавторитарные и нонконформистские идеи в песнях, наполненных описаниями социальной изоляции, неврозов, бедности и паранойи. Эти темы получили дальнейшее развитие, когда в 1981 году к группе присоединился Генри Роллинз в качестве вокалиста. Бо́льшая часть материала группы была выпущена на независимом лейбле Гинна SST Records.\nНа протяжении 1980-х годов звучание Black Flag, как и их популярность, менялось. Помимо того, что они сыграли ключевую роль в создании хардкор-панка, они были новаторами первой волны американского панк-рока на Западном побережье и оказали значительное влияние на панк-субкультуру в США и за рубежом. Помимо того, что они были одной из первых панк-рок-групп, в чьём звучании присутствовали элементы и влияние мелодий и ритма хэви-метала, в их музыке часто звучали элементы фри-джаза и современной классической музыки, особенно в гитарных партиях Гинна, и на протяжении всей своей карьеры группа перемежала записи и выступления инструментальными композициями. Они также исполняли более длинные, медле", "sources_count": 2, "entities": ["Грегом Гинном,", "Высокодозный Цитарабин", "Гинна SST Records.", "Генри Роллинз", "США, Канаде", "Европе Black Flag", "New York Dolls", "Высокодозного Цитарабина", "Китом Моррисом. Являясь", "Black Flag", "Novantrone. T-FLAG", "Джонни Сандерса,", "What The…", "Black Flag,"]}