{"content": "Blink-182 is an American rock band formed in Poway, California, in 1992. Its current and most widely recognized line-up consists of bassist and vocalist Mark Hoppus, guitarist and vocalist Tom DeLonge, and drummer Travis Barker. Though its sound has diversified throughout their career, its musical style, described as pop-punk, blends catchy pop melodies with fast-paced punk rock. Its lyrics primarily focus on relationships, adolescent frustration, and maturity, or lack thereof. The group emerged from a suburban, Southern California skate punk scene and first gained notoriety for high-energy live shows and irreverent humor.\nThe band's debut, Cheshire Cat, and second studio album, Dude Ranch, were released in 1995 and 1997 respectively, through independent imprint Grilled Cheese, a subdivision of Cargo Records. These releases helped the band gain moderate success around the local San Diego punk scene and abroad (namely Australia), which brought attention from major labels amid the punk rock resurgence on a mainstream scale post-Dookie. After years of independent recording and touring, including stints on the Warped Tour, the group signed to MCA Records. Its third and fourth albums—Enema of the State (1999) and Take Off Your Pants and Jacket (2001)—had the greatest commercial success while the singles \"All the Small Things\", \"Dammit\", and \"What's My Age Again?\" became hit songs and MTV staples. Later efforts, including an untitled album (2003), Neighborhoods (2011), and an EP Dogs Eating Dogs (2012), marked stylistic shifts. Hoppus is the only member to remain in the band throughout its history. DeLonge left the group twice, a decade apart, before returning again. Founding drummer Scott Raynor recorded and toured with the group before being dismissed in 1998 and replaced by Barker. During DeLonge's absence from 2015 to 2022, the band included Alkaline Trio singer and guitarist Matt Skiba, with whom it recorded two albums, California (2016), and Nine (2019), and toured ", "sources_count": 1, "entities": ["Alkaline Trio", "Take Off Your", "Cheshire Cat,", "Following DeLonge’s", "Dogs Eating Dogs", "Warped Tour,", "Mark Hoppus,", "Barker. During DeLonge", "Scott Raynor", "Dude Ranch,", "Southern California", "San Diego", "Grilled Cheese,", "Matt Skiba,", "MCA Records. Its", "Travis Barker. Though", "One More Time...,", "Cargo Records. These", "Small Things\",", "Age Again?\""]}