{"content": "Blink-182 (also referred to as the untitled album) is the fifth studio album by American rock band Blink-182, released on November 18, 2003, by Geffen Records. Following the blockbuster success of their last two albums, Enema of the State and Take Off Your Pants and Jacket, the trio went on hiatus and participated in various side projects including Box Car Racer and Transplants. When they regrouped, they decided to approach their next album by placing more attention on song structure and musical arrangements. Their longest album, it marks a shift toward a darker, more expansive and complex sound; its interconnected songs and cinematic structure blur the lines between pop-punk and post-hardcore.\nThe recording process for the album began in a rented San Diego mansion and evolved into a costly project spanning over a year, two record labels, and more than a million dollars. The band, led by producer Jerry Finn, transformed the house into a fully equipped \"musical laboratory,\" using an extensive array of vintage gear, experimental instruments, and unconventional analog techniques. Its songwriting is more personal in nature and explores mature territory, touching upon the realities of adulthood and unexpected hardships, as well as personal growth and global unrest. Its ambiguous title embraces a serious, undefined identity, complemented by cover art introducing an iconographic \"smiley\" logo inspired by edgy pop art and punk aesthetics. The album features a gothic collaboration with Robert Smith of The Cure.\nReleased at the forefront of the emo cultural peak, the album proved successful, selling 2.2 million copies in the United States. It received positive reviews, with critics welcoming its change in tone. Lead singles  \"Feeling This\" and  \"I Miss You\" received the most radio airplay out of the four singles released, and peaked high on Billboard charts. The worldwide touring schedule, which saw the band travel to Japan and Australia, also found the three performing for U", "sources_count": 1, "entities": ["Middle East. The", "The Cure. Released", "San Diego", "Box Car Racer", "Geffen Records. Following", "Jerry Finn,", "Transplants. When", "Robert Smith", "Take Off Your", "United States. It", "Miss You\"", "Jerry Finn"]}