{"content": "Dead Kennedys are an American punk rock band that formed in San Francisco, California, in 1978. The band was one of the defining bands of the American punk scene during its initial eight-year run.\nThe band's lineup initially consisted of lead guitarist East Bay Ray, bassist Klaus Flouride, lead vocalist Jello Biafra, drummer Ted and rhythm guitarist 6025; 6025 left in 1979, and Ted left the following year after the band recorded their acclaimed first album Fresh Fruit for Rotting Vegetables (1980). The band's longest-serving drummer was D. H. Peligro, who replaced Ted in 1981 and remained until his death in 2022. Dead Kennedys recorded the EP In God We Trust Inc. (1981), followed by three more studio albums, Plastic Surgery Disasters (1982), Frankenchrist (1985), and Bedtime for Democracy (1986), the latter of which was recorded and released shortly after announcing their breakup in January 1986. Most of the band's recordings were released on Alternative Tentacles, an independent record label founded by Biafra and East Bay Ray.\nFollowing Dead Kennedys' dissolution, Biafra continued to run Alternative Tentacles, and went on to collaborate and record with other artists, including D.O.A., NoMeansNo and his own bands Lard and the Guantanamo School of Medicine, as well as releasing several spoken word performances. In 2000 (upheld on appeal in 2003), Biafra lost an acrimonious legal case initiated by his former Dead Kennedys bandmates over songwriting credits and unpaid royalties. In 2001, the band reformed without Biafra; various singers have since been recruited for vocal duties. Although Dead Kennedys have continued to perform over the years, they have not released any more studio albums since Bedtime for Democracy.\nDead Kennedys' lyrics were usually political in nature, satirizing political figures and authority in general, as well as popular culture and even the punk movement itself. During their initial incarnation between 1978 and 1986, they attracted considerable", "sources_count": 1, "entities": ["Alternative Tentacles,", "D.O.A., NoMeansNo", "Following Dead Kennedys", "Jello Biafra,", "Plastic Surgery Disasters", "Although Dead Kennedys", "Jello Biafra", "Parents Music Resource", "Rotting Vegetables", "East Bay Ray.", "Dead Kennedys", "Fresh Fruit", "Democracy. Dead Kennedys", "Guantanamo School", "San Francisco, California,", "God We Trust", "Klaus Flouride,", "East Bay Ray,"]}