{"content": "A day is the time period of a full rotation of the Earth with respect to the Sun.  On average, this is 24 hours (86,400 seconds). As a day passes at a given location it experiences morning, afternoon, evening, and night. This daily cycle drives circadian rhythms in many organisms, which are vital to many life processes.\nA collection of sequential days is organized into calendars as dates, almost always into weeks, months and years. A solar calendar organizes dates based on the Sun's annual cycle, giving consistent start dates for the four seasons from year to year. A lunar calendar organizes dates based on the Moon's lunar phase.\nIn common usage, a day starts at midnight, written as 00:00 or 12:00 am in 24- or 12-hour clocks, respectively. Because the time of midnight varies between locations, time zones are set up to facilitate the use of a uniform standard time. Other conventions exist for marking the beginning and end of days, such as the Jewish religious calendar which counts days beginning at sunset, or in astronomy, in which a day begins at noon so that observations throughout a single night are recorded as happening on the same day.\nIn specific applications, the definition of a day is slightly modified, such as in the SI day (exactly 86,400 seconds) used for computers and standards keeping, local mean time accounting of the Earth's natural fluctuation of a solar day, and stellar day and sidereal day (using the celestial sphere) used for astronomy.  In some countries outside of the tropics, daylight saving time is practiced, and each year there will be one 23-hour civil day and one 25-hour civil day.  Due to slight variations in the rotation of the Earth, there are rare times when a leap second will get inserted at the end of a UTC day, and so while almost all days have a duration of 86,400 seconds, there are these exceptional cases of a day with 86,401 seconds (in the half-century spanning 1972 through 2022, there have been a total of 27 leap seconds that hav", "sources_count": 1, "entities": ["Sun. On"]}