{"content": "The American rapper Jay-Z has released 68 singles as a lead artist, 51 singles as a featured artist, and 14 promotional singles. \"Can't Knock the Hustle\" was the rapper's breakout hit, serving as lead single for his debut studio album, Reasonable Doubt (1996). During 1997, Jay-Z saw continued success with his singles \"Sunshine\" (featuring Foxy Brown and Babyface), which peaked at number 25 on the UK singles chart, and \"Wishing on a Star\", which peaked at number 13. \"The City Is Mine\" (featuring Blackstreet) was the most successful single of his second album, In My Lifetime, Vol. 1 (1997), which peaked at number three on the US Billboard 200 and received positive reviews from critics. In 1998, he released the singles \"Can I Get A...\" (featuring Ja Rule and Amil) and \"Hard Knock Life (Ghetto Anthem)\", which peaked at numbers 19 and 15 on the US Billboard Hot 100, respectively. Both preceded his third album, Vol. 2... Hard Knock Life (1998), and led it to debut atop the Billboard 200. His fourth album, Vol. 3... Life and Times of S. Carter (1999), became his second album to do so, and spawned the Billboard Hot 100-top 40 singles \"Jigga My Nigga\" and \"Big Pimpin'\" (featuring UGK); the latter received platinum certification by the RIAA.\nHis fifth album, The Dynasty: Roc La Familia (2000), began production as a compilation album for his then-expanding record label, Roc-A-Fella Records, but ultimately served to showcase its signees. Selling 500,000 copies in its first week, it also received double platinum certification by the RIAA and was supported by the pop-oriented single, \"I Just Wanna Love U (Give It 2 Me)\" (featuring Pharrell), which peaked at number 11 on the Billboard Hot 100 and became his first to reach number one on the R&B/Hip-Hop Songs chart. His sixth album, The Blueprint (2001), was met with universal acclaim and the  sold 400,000 copies in its first week, becoming his third consecutive project to debut atop the Billboard 200; it spawned his first Billboard", "sources_count": 1, "entities": ["Lifetime, Vol.", "Linkin Park", "Hard Knock Life", "Beyoncé). The Black", "The Best", "The Dynasty: Roc", "Knock Life", "Problems\". Even", "Grammy. After", "City Is Mine\"", "Kanye West, Watch", "Get A...\"", "Just Wanna Love", "What You Got\",", "United States National", "Roc-A-Fella Records,", "Billboard Hot", "Reasonable Doubt", "RIAA. His", "Both Worlds,"]}