{"content": "Kali Linux — GNU/Linux-LiveCD, возникший как результат слияния WHAX и Auditor Security Collection. Проект создали Мати Ахарони (Mati Aharoni) и Макс Мозер (Max Moser). Предназначен прежде всего для проведения тестов на безопасность. Наследник развивавшегося до 2013 года на базе Knoppix дистрибутива BackTrack.\nПопулярность Kali Linux выросла после показа в нескольких эпизодах сериала Mr. Robot. Инструменты, показанные в фильме, включают Bluesniff, Bluetooth Scanner (btscanner), John the Ripper, Metasploit Framework, nmap, Shellshock и wget.\n\nKali Linux  is a Linux distribution designed for digital forensics and penetration testing. It is maintained and funded by Offensive Security. The software is based on the testing branch of the Debian Linux Distribution: most packages Kali uses are imported from the Debian repositories. Kali Linux has gained popularity in the cybersecurity community due to its comprehensive set of tools designed for penetration testing, vulnerability analysis, and reverse engineering. \nIt was developed by Mati Aharoni and Devon Kearns of Offensive Security through the rewrite of BackTrack, their previous information security testing Linux distribution based on Knoppix.\nKali Linux was featured in multiple episodes of the TV series Mr. Robot.\n\nLinux ( LIN-uuks) is a family of open source Unix-like operating systems based on the Linux kernel, a kernel first released on September 17, 1991, by Linus Torvalds. Linux is typically packaged as a Linux distribution (distro), which includes the kernel and supporting system software and libraries—most of which are provided by third parties—to create a complete operating system, designed as a clone of Unix and released under the copyleft GPL license.\nThousands of Linux distributions exist, many based directly or indirectly on other distributions; popular Linux distributions include Debian, Fedora Linux, Linux Mint, Arch Linux, and Ubuntu, while commercial distributions include Red Hat Enterprise Linux, SUSE L", "sources_count": 3, "entities": ["Linux Mint, Arch", "Mati Aharoni", "Kali Linux", "Devon Kearns", "Debian, Fedora Linux,", "Mr. Robot. Linux", "Moser). Предназначен", "Bluesniff, Bluetooth Scanner", "Ripper, Metasploit Framework,", "BackTrack. Популярность Kali", "Debian Linux Distribution:", "Mr. Robot. Инструменты,", "Red Hat Enterprise", "Макс Мозер", "Many Linux", "Auditor Security Collection.", "ChromeOS. Linux", "Offensive Security. The", "Free Software Foundation", "Offensive Security"]}