{"content": "A Zeppelin is a type of rigid airship named after the German inventor Ferdinand von Zeppelin (German pronunciation: [ˈt͡sɛpəliːn] ) who pioneered rigid airship development at the beginning of the 20th century. Zeppelin's notions were first formulated in 1874 and developed in detail in 1893. They were patented in Germany in 1895 and in the United States in 1899. After the outstanding success of the Zeppelin design, the word zeppelin came to be commonly used to refer to all forms of rigid airships. Zeppelins were first flown commercially in 1910 by Deutsche Luftschiffahrts-AG (DELAG), the world's first airline in revenue service. By mid-1914, DELAG had carried over 10,000 fare-paying passengers on over 1,500 flights. During World War I, the German military made extensive use of Zeppelins as bombers and as scouts. Numerous bombing raids on Britain resulted in over 500 deaths.\nThe defeat of Germany in 1918 temporarily slowed the airship business. Although DELAG established a scheduled daily service between Berlin, Munich, and Friedrichshafen in 1919, the airships built for that service eventually had to be surrendered under the terms of the Treaty of Versailles, which also prohibited Germany from building large airships. An exception was made to allow the construction of one airship for the United States Navy, the order for which saved the company from extinction.\nIn 1926, the restrictions on airship construction were lifted and, with the aid of donations from the public, work began on the construction of LZ 127 Graf Zeppelin. That revived the company's fortunes and, during the 1930s, the airships Graf Zeppelin, and the even larger LZ 129 Hindenburg operated regular transatlantic flights from Germany to North America and Brazil. The spire of the Empire State Building was originally designed to serve as a mooring mast for Zeppelins and other airships, although it was found that high winds made that impossible and the plan was abandoned. The Hindenburg disaster in 1937, a", "sources_count": 1, "entities": ["Empire State Building", "Deutsche Luftschiffahrts-AG", "United States", "Graf Zeppelin. That", "Graf Zeppelin,", "Brazil. The", "North America", "Berlin, Munich,", "World War II,", "During World War", "Although DELAG", "The Hindenburg", "United States Navy,"]}