{"content": "Made in Abyss (яп. メイドインアビス Мэидо ин Абису) — манга авторства Акихито Цукуси, повествующая о приключениях девочки Рико и робота Рега в Бездне. Манга публикуется в онлайн-журнале Web Comic Gamma с 2012 года и на данный момент собрана в 14 томах. По состоянию на август 2025 года общее количество проданных экземпляров манги превысило 22 миллиона. \nПо мотивам манги студией Kinema Citrus был выпущен аниме-сериал, начавший свою трансляцию 7 июля 2017 года. Музыку к аниме написал австралийский композитор Кевин Пенкин. Зимой 2019 года вышла компиляция-сериала в виде двух полнометражных фильмов Made in Abyss: Journey's Dawn и Made in Abyss: Wandering Twilight. Также было объявлено о третьем полнометражном фильме-продолжении под названием Made in Abyss: Dawn of the Deep Soul, премьера которого в Японии состоялась 17 января 2020 года. 6 июля 2022 года начата трансляция второго сезона аниме. В январе 2023 года было объявлено, что аниме получит продолжение. В августе 2025 года стало известно, что продолжение выйдет в виде нескольких фильмов, первый из которых будет выпущен в 2026 году.\n\nIn the Sicilian and American Mafia, a made man is a fully initiated member of the Mafia. In order to become eligible to be \"made\", an associate must fulfill several requirements, such as being Italian or of Italian descent and sponsored by another made man. An inductee will be required to take the oath of omertà, the Mafia code of silence and code of honor. After the induction ceremony, the associate becomes a \"made man\" and holds the rank of soldier (Italian: soldato) in the Mafia hierarchy. Made men are the only ones who can rise through the ranks of the Mafia, from soldier to caporegime, consigliere, underboss, and boss.\nOther common names for members include man of honor (Italian: uomo d'onore), man of respect (Italian: uomo di rispetto), one of us (Italian: uno di noi), friend of ours (Italian: amico nostro), good fella, and wiseguy, although the last two terms can also apply to non-initiate", "sources_count": 3, "entities": ["Web Comic Gamma", "Deep Soul,", "Sicilian Mafia", "Mafia. In", "Kinema Citrus", "Бездне. Манга", "Акихито Цукуси,", "Abyss: Wandering Twilight.", "Abyss: Journey Dawn", "Abyss: Dawn", "Кевин Пенкин. Зимой", "American Mafia,"]}