{"content": "Metallica («Мета́ллика») — американская метал-группа, созданная вокалистом и гитаристом Джеймсом Хетфилдом и барабанщиком Ларсом Ульрихом в Лос-Анджелесе, штат Калифорния, в 1981 году. Одна из наиболее популярных и влиятельных команд в истории рока, Metallica входит в так называемую «большую четвёрку» основоположников и ключевых коллективов жанра трэш-метал (наряду с группами Slayer, Megadeth и Anthrax), оказавших определяющее влияние на его развитие, и считается, что творчество этих коллективов положило начало развитию данного направления в музыке. Современный состав Metallica состоит из основателей и основных авторов песен Хетфилда и Ульриха, давнего соло-гитариста Кирка Хэмметта и басиста Роберта Трухильо. Гитарист Дэйв Мастейн (который продолжил своё творчество с момента формирования Megadeth после увольнения из группы) и басисты Рон Макговни, Клифф Бёртон и Джейсон Ньюстед — бывшие участники группы.\nГруппа получила сторонников в среде поклонников андеграундной музыки и одобрительные отзывы критиков, выпустив третий студийный альбом Master of Puppets (1986), который сейчас считается «классикой трэш-метала» и который существенно повлиял на дальнейшее развитие этого жанра. Коммерческий успех пришёл после выпуска пятого альбома The Black Album или «Metallica», который дебютировал на первой строчке чарта Billboard 200. В 2000 году Metallica были в числе музыкальных исполнителей, подавших иск против Napster, в связи с бесплатным распространением материалов, защищённых авторским правом, без разрешения авторов. В результате, была достигнута договорённость, по которой Napster стал платным сервисом. Несмотря на первое место в Billboard 200, альбом St. Anger (2003) из-за отсутствия гитарных соло, «стального звучания» малого барабана и сырости звучания разочаровал многих фанатов группы. В фильме Some Kind of Monster показан процесс создания St. Anger и напряжённые отношения между участниками группы в течение этого времени. В 2009 году Metallica была введена в Зал славы рок", "sources_count": 2, "entities": ["Ron McGovney, Cliff", "Соединённых Штатах. В", "Robert Trujillo. Former", "Kirk Hammett", "Jason Newsted,", "Los Angeles", "Blackened Recordings", "Slayer. Metallica", "Grammy Award", "Дэйв Мастейн", "United States", "Nielsen SoundScan", "Slayer, Megadeth", "Some Kind", "San Francisco Symphony),", "St. Anger", "The Black Album", "Роберта Трухильо. Гитарист", "Forbes. Заработанная", "Metallica: Through"]}