{"content": "Pink Floyd (рус. Пинк Флойд) — британская рок-группа, знаменитая своими продолжительными композициями и объединёнными в тематические сюиты песнями, звуковыми экспериментами, философскими текстами, дизайном обложек альбомов и грандиозными концертными шоу. Является одной из наиболее влиятельных и коммерчески успешных групп в истории мировой рок-музыки — в её активе более 250 млн проданных альбомов в мире, в том числе 75 млн — в США.\nГруппа была основана в 1965 году однокурсниками по архитектурному факультету Лондонского политехнического института Ричардом Райтом (клавишные, вокал), Роджером Уотерсом (бас-гитара, вокал), Ником Мейсоном (ударные) и их другом из Кембриджа Сидом Барреттом (вокал, гитара). Первоначальное название «The Pink Floyd Sound» было придумано лидером группы и автором большинства текстов раннего периода — Барреттом, в 1967 году оно было сокращено до «Pink Floyd». В начале того же года группа выпустила свои первые синглы, а в августе — дебютный студийный альбом The Piper at the Gates of Dawn, ставший классикой психоделического рока.\nВ конце 1967 года к четвёрке музыкантов присоединился гитарист Дэвид Гилмор. Он заменил страдавшего в то время от наркотической зависимости Барретта, который часто срывал записи и концерты. Какое-то время Барретт и Гилмор играли на одной сцене, но Барретт либо играл один аккорд за всё выступление, либо не играл вообще.\nПосле ухода Барретта доминирующими фигурами в группе стали Роджер Уотерс и Ричард Райт, однако со временем Райт уступил позиции Гилмору. В период 1968—1972 годов группой были выпущены шесть альбомов (два из которых содержат музыку к фильмам). В 1973 году состоялся релиз самой успешной пластинки группы — The Dark Side of the Moon, сразу же сделавшей Pink Floyd явлением мирового масштаба. За ней последовали альбомы Wish You Were Here (1975) и Animals (1977), ещё больше увеличившие международную известность коллектива.\nС каждым новым альбомом Роджер Уотерс укреплял своё лидерство в Pink Floyd, постепенно превр", "sources_count": 2, "entities": ["Tom Morello)", "США. Группа", "Ником Мейсоном", "Райт. В", "Сатриани, Стив Вай", "Даймбэг Даррелл,", "Гилмору. В", "The Division Bell,", "Ричардом Райтом", "The Piper", "Whammy Pedal». Когда", "Ричард Райт,", "Флойда Роуза. Оно", "Райта. После", "The Dark Side", "Роджером Уотерсом", "Thunder. В", "Floyd Rose", "Momentary Lapse", "Pink Floyd"]}