{"content": "Queensland (locally  KWEENZ-land,  commonly abbreviated as QLD) is a state in northeastern Australia, the second-largest and third-most populous state in Australia. It is bordered by the Northern Territory, South Australia and New South Wales to the west, south-west and south, respectively. To the east, Queensland is bordered by the Coral Sea and the Pacific Ocean; to the state's north is the Torres Strait, separating the Australian mainland from Papua New Guinea, and the Gulf of Carpentaria to the north-west. With an area of 1,723,030 square kilometres (665,270 sq mi), Queensland is the world's sixth-largest subdivision of any country on earth; it is larger than all but 16 countries. Due to its size, Queensland's geographical features and climates are diverse, and include tropical rainforests, rivers, coral reefs, mountain ranges and white sandy beaches in its tropical and sub-tropical coastal regions, as well as deserts and savanna in the semi-arid and desert climatic regions of its interior.\nQueensland has a population of over 5.5 million, concentrated in South East Queensland, where nearly three in four reside. The capital and largest city in the state is Brisbane, Australia's third-largest city and comprising fully half of the state's population. Ten of Australia's thirty largest cities are located in Queensland, the largest outside Brisbane being the Gold Coast, the Sunshine Coast, Townsville, Cairns, Ipswich, and Toowoomba. 24.2% of the state's population were born overseas. The state has the highest inter-state net migration in Australia.\nQueensland was first inhabited by Aboriginal Australians, with the Torres Strait Islands inhabited by Torres Strait Islanders. Dutch navigator Willem Janszoon, the first European to land in Australia, explored the west coast of the Cape York Peninsula in 1606. In 1770, James Cook claimed the east coast of Australia for the Kingdom of Great Britain. In 1788, Arthur Phillip founded the colony of New South Wales, which include", "sources_count": 1, "entities": ["Torres Strait,", "Gold Coast,", "Great Britain. In", "Queensland. Queensland", "Australia. It", "New South Wales", "Cairns, Ipswich,", "Sunshine Coast, Townsville,", "James Cook", "Coral Sea", "Pacific Ocean;", "John Oxley. During", "Papua New Guinea,", "Willem Janszoon,", "Torres Strait Islands", "Aboriginal Australians,", "Arthur Phillip", "Moreton Bay Penal", "Great Barrier Reef,", "South Sea Islander"]}