{"content": "Sex Pistols (рус. Секс пистолс; МФА: [sɛks ˈpɪst(ə)lz]) — британская панк-рок-группа, образованная в 1975 году в Лондоне. Коллектив стал олицетворением субкультуры панка, а его участники — инициаторами так называемой «панк-революции» в Великобритании. Своим творчеством и идеологией Sex Pistols вдохновили огромное количество исполнителей более позднего периода, представляющих практически все направления рок-музыки. Группа считается одним из самых влиятельных коллективов 1970-х годов.\nПервоначально в состав Sex Pistols входили вокалист Джонни Роттен, гитарист Стив Джонс, барабанщик Пол Кук и бас-гитарист Глен Мэтлок, а в качестве импресарио группы выступал Малкольм Макларен. В начале 1977 года Мэтлок был заменён Сидом Вишесом. Являясь выходцами из низших социальных слоёв, Sex Pistols призывали к анархии, проявляли полное неуважение к королевской семье и политическому строю Великобритании, что нашло отражение в их песнях «Anarchy in the U.K.» и «God Save the Queen», тем самым породив острые споры между многочисленными сторонниками и противниками музыкантов. Телеканалы и радиостанции отказывались транслировать композиции Sex Pistols, концерты группы, часто заканчивавшиеся потасовками, неоднократно запрещались, тиражи пластинок арестовывались. Музыканты выпустили всего один студийный альбом Never Mind the Bollocks, Here’s the Sex Pistols, который изменил путь развития популярной музыки и стал одним из наиболее важных дисков для рок-индустрии в целом. Несмотря на скандалы, связанные с выпуском пластинки, она стала сначала золотой, а затем и платиновой в США и Великобритании, а также золотой в Нидерландах.\nНесмотря на непродолжительность наиболее активной фазы своего существования (чуть более двух лет), Sex Pistols навсегда приобрели репутацию одного из самых скандальных и провокационных музыкальных коллективов за всю историю. В 2006 году группа была включена в американский Зал славы рок-н-ролла.", "sources_count": 1, "entities": ["Never Mind", "Лондоне. Коллектив", "Sex Pistols", "Sex Pistols,", "Великобритании. Своим", "Пол Кук", "Джонни Роттен,", "Стив Джонс,", "Сидом Вишесом. Являясь", "Малкольм Макларен. В", "Bollocks, Here’s", "Нидерландах. Несмотря", "Глен Мэтлок,"]}