{"content": "Doggystyle — дебютный студийный альбом американского рэп-исполнителя Snoop Doggy Dogg, выпущенный 23 ноября 1993 года на лейблах Death Row Records, Interscope Records, Atlantic Records. Запись альбома началась сразу после выхода The Chronic — дебютного альбома Dr. Dre.\nSnoop Dogg стал популярен ещё в 1992 году, когда он появился на нескольких треках в альбоме Dr. Dre The Chronic (включая «Nuthin' But a \"G\" Thang»). Именно в альбоме Дре появился жанр G-Funk, который представляет собой микс из гангста-рэпа и P-Funk’a.\nСразу после выпуска The Chronic началась запись Doggystyle.\nТексты альбома повествуют об убийствах и разборках, про вечеринки и секс, о жизни настоящего калифорнийского гангстера. Весь альбом по звучанию напоминает The Chronic. Журнал Rolling Stone назвал этот альбом «точной копией» The Chronic. Единственное отличие этого альбома от The Chronic — это то, что в Doggystyle нет упоминаний о наркотиках.\nБольшую часть альбома спродюсировал Dr. Dre. Однако некоторые треки были спродюсированы Warren G, Daz Dilligner и DJ Pooh.\nАльбом дебютировал на первом месте в Billboard 200, с продажами 803 000 копий за первую неделю. Альбом продержался три недели на первом месте в этом чарте.\nВсего в Америке было продано 6 миллионов копий и 14 миллионов копий по всему миру.\n\nDogg or The Dogg is a stage name or ring name which may refer to:\n\nThe Dogg (born 1983), Namibian musician\nTha Dogg Pound, American hip hop group\nNate Dogg (1969–2011), American rapper and R&B artist\nRed Dogg, a member of the hip hop group C-Block\nRoad Dogg, American professional wrestler\nSnoop Dogg (born 1971), American rapper\nSwamp Dogg (born 1942), American soul artist\nDeso Dogg (1975-2018), German rapper and ISIL Member\nTymon Dogg (born 1950), British musician", "sources_count": 2, "entities": ["Rolling Stone", "Nate Dogg", "C-Block Road Dogg,", "Dr. Dre The", "Dr. Dre. Однако", "Dr. Dre. Snoop", "Warren G, Daz", "Swamp Dogg", "Red Dogg,", "Records. Запись", "The Chronic. Единственное", "P-Funk’a. Сразу", "Interscope Records, Atlantic", "Pooh. Альбом", "ISIL Member Tymon", "Thang»). Именно", "Death Row Records,", "Snoop Doggy Dogg,", "Deso Dogg", "The Chronic"]}