{"content": "Social engineering may refer to:\n\nSocial engineering (political science), a means of influencing particular attitudes and social behaviors on a large scale\nSocial engineering (security), obtaining confidential information by manipulating or deceiving people\n\nEngineering Research Associates — американская компьютерная компания, известная также как ERA, созданная в январе 1946 года, и стоявшая у истоков компьютерной эры. Компания известна благодаря своим цифровым компьютерам, но по мере расширения рынка наибольшую известность ей принесло изобретение систем хранения данных на основе магнитного барабана.\nВ 1952 году компания была приобретена компанией Remington Rand и присоединена к подразделению UNIVAC Division, созданному на основе другой недавно приобретенной компании — Eckert–Mauchly Computer Corporation. После слияния с Remington Rand большая часть сотрудников компании в 1957 году покинула её и основала компанию Control Data Corporation. В ERA начал свою карьеру инженер компьютерных систем знаменитый Сеймур Крэй.\n\nEngineering is the practice of using natural science, mathematics, and the engineering design process to solve problems within technology, increase efficiency and productivity, and improve systems. The traditional disciplines of engineering are civil, mechanical, electrical, and chemical. The academic discipline of engineering encompasses a broad range of more specialized subfields, and each can have a more specific emphasis for applications of mathematics and science. In turn, modern engineering practice spans multiple fields of engineering, which include designing and improving infrastructure, machinery, vehicles, electronics, materials, and energy systems. For related terms, see glossary of engineering.\nAs a human endeavor, engineering has existed since ancient times, starting with the six classic simple machines. Examples of large-scale engineering projects from antiquity include impressive structures like the pyramids, elegant temples such as the Par", "sources_count": 3, "entities": ["UNIVAC Division,", "Сеймур Крэй. Engineering", "Eckert–Mauchly Computer Corporation.", "Remington Rand", "Engineering Research Associates", "Control Data Corporation."]}