{"content": "The Beatles were an English rock band formed in Liverpool in 1960. The core lineup of the band comprised John Lennon, Paul McCartney, George Harrison and Ringo Starr. They are widely regarded as the most influential band in popular music and were integral to the development of 1960s counterculture and the recognition of popular music as an art form. Rooted in skiffle, beat and 1950s rock 'n' roll, their sound incorporated elements of classical music and traditional pop in innovative ways. The band also explored music styles ranging from folk and Indian music to psychedelia and hard rock. As pioneers in recording, songwriting and artistic presentation, the Beatles revolutionised many aspects of the music industry and were often publicised as leaders of the era's youth and sociocultural movements.\nLed by primary songwriters Lennon and McCartney, the Beatles evolved from Lennon's previous group, the Quarrymen, and built their reputation by playing clubs in Liverpool and Hamburg, Germany, starting in 1960. The core trio of Lennon, McCartney and Harrison, together since 1958, went through a succession of drummers before inviting Starr to join them in 1962. Manager Brian Epstein moulded them into a professional act, and producer George Martin developed their recordings, greatly expanding their domestic success after they signed with EMI and achieved their first hit, \"Love Me Do\", in late 1962. As their popularity grew into the intense fan frenzy dubbed \"Beatlemania\", the band acquired the nickname \"the Fab Four\". By early 1964, the Beatles were international stars and had achieved unprecedented levels of critical and commercial success. They became a leading force in Britain's cultural resurgence, ushering in the British Invasion of the United States pop market. They soon made their film debut with A Hard Day's Night (1964). \nA growing desire to refine their studio efforts, coupled with the challenging nature of their concert tours, led to the band's retirement from live ", "sources_count": 1, "entities": ["George Martin", "Apple Corps,", "McCartney, George Harrison", "Rolling Stone", "Sgt. Pepper Lonely", "Lennon, McCartney", "Let It Be)", "Brit Awards,", "Albums Chart", "Best Original Song", "White Album\",", "United States", "Ivor Novello Awards.", "Abbey Road", "Hamburg, Germany,", "Grammy Awards,", "U.S. Billboard Hot", "Manager Brian Epstein", "Roll Hall", "Academy Award"]}