{"content": "The Irishman est un film de gangsters américain coproduit et réalisé par Martin Scorsese et sorti en 2019. Il s’agit de l'adaptation du livre I Heard You Paint Houses: Frank ‘The Irishman’ Sheeran and the Inside Story of the Mafia, the Teamsters, and the Final Ride by Jimmy Hoffa de Charles Brandt, qui retrace la vie de Frank Sheeran.\nLe film débute alors que depuis sa maison de retraite, Frank Sheeran se remémore sa vie. Vétéran de la Seconde Guerre mondiale, « The Irishman » officie à Philadelphie comme chauffeur de camion dans les années 1950. Accusé de vol, il est défendu par l'avocat Bill Bufalino. Ce dernier lui présente son cousin, Russell Bufalino. Frank se lie rapidement avec Russell et se rapproche peu à peu de la mafia italienne locale. Il devient un homme à tout faire et un tueur à gages efficace. Russell lui présente alors l'un des hommes les plus influents des États-Unis, Jimmy Hoffa, président du puissant syndicat International Brotherhood of Teamsters.\nLe film est présenté en avant-première au festival du film de New York le 27 septembre 2019 ainsi qu'au festival Lumière de Lyon le 15 octobre, puis est disponible mondialement sur Netflix à partir du 27 novembre.\nEn salles, il bénéficie d'une sortie limitée en novembre aux États-Unis, au Canada et au Royaume-Uni, mais elle ne s'applique pas à tous les pays du monde, dont la France.\n\nIris Marion Young (Nueva York, 2 de enero de 1949- Chicago, 1 de agosto de 2006) fue una filósofa política y feminista​ que centró sus trabajos en el área de la filosofía política, la naturaleza de la justicia y las diferencias sociales. Fue profesora de Ciencias Políticas en la Universidad de Chicago y estuvo afiliada al Centro de Estudios de Género y al programa de Derechos Humanos de dicha universidad. Sus investigaciones cubren los campos de la teoría política contemporánea, la teoría social feminista y el análisis normativo de las políticas públicas. Ella creía en la importancia del activismo político y alentó a sus e", "sources_count": 2, "entities": ["France. Iris Marion", "Frank Sheeran. Le", "The Irishman", "New York", "Teamsters. Le", "Charles Brandt,", "Jimmy Hoffa", "Derechos Humanos", "Martin Scorsese", "Heard You Paint", "Irishman’ Sheeran", "Inside Story", "International Brotherhood", "Bill Bufalino. Ce", "Seconde Guerre", "Houses: Frank", "Final Ride", "Ciencias Políticas", "Frank Sheeran", "Russell Bufalino. Frank"]}