{"content": "The Beatles (commonly referred to as The White Album) is the ninth studio album and only double album by the English rock band the Beatles, released on 22 November 1968. Featuring a plain white sleeve, the cover contains no graphics or text other than the band's name embossed. This was intended as a direct contrast to the vivid cover artwork of the band's previous LP, Sgt. Pepper's Lonely Hearts Club Band (1967). The Beatles is recognized for its fragmentary style and diverse range of genres, including folk, country rock, British blues, ska, music hall, hard rock, and avant-garde. It has since been viewed by some critics as a postmodern work, and is widely regarded as one of the greatest albums of all time. The album was the band's first LP release on their then-recently founded Apple Records after previous albums were released on Parlophone in the United Kingdom and Capitol Records in the United States.\nIn late May 1968, the Beatles returned to EMI Studios in London to commence recording sessions that lasted until mid-October. During these sessions, arguments frequently broke out among the foursome over creative differences and the presence of John Lennon's new partner, Yoko Ono, which subverted the Beatles' policy of excluding wives and girlfriends from the studio. After a series of problems, including producer George Martin taking an unannounced holiday and engineer Geoff Emerick suddenly quitting during a session, Ringo Starr left the band for two weeks in August. The same tensions continued throughout the following year and led to the band's break-up.\nThe album features 30 songs, 19 of which were written during March and April 1968 at a Transcendental Meditation course in Rishikesh, India. There, the only Western instrument available to the band was the acoustic guitar; several of these songs remained acoustic on The Beatles and were recorded solo, or only by part of the group. The production aesthetic ensured that the album's sound was scaled down and less rel", "sources_count": 1, "entities": ["The White Album)", "George Martin", "August. The", "United States. In", "EMI Studios", "John Lennon", "Ringo Starr", "United States. No", "Geoff Emerick", "United Kingdom", "Lonely Hearts Club", "LP, Sgt. Pepper", "Capitol Records", "Transcendental Meditation", "Apple Records", "Recording Industry Association", "Yoko Ono,", "The Beatles", "Rishikesh, India. There,"]}