{"content": "«Бегу́щий по ле́звию» (англ. Blade Runner) — американский художественный фильм, снятый английским режиссёром Ридли Скоттом в марте — июле 1981 года по мотивам научно-фантастического романа Филипа Дика «Мечтают ли андроиды об электроовцах?» (1968). Главные роли в кинофильме исполнили Харрисон Форд, Шон Янг, Рутгер Хауэр, Эдвард Джеймс Олмос, Дэрил Ханна, Джоанна Кэссиди, Брайон Джеймс.\nВ центре сюжета история детектива из специального отдела полиции Лос-Анджелеса Рика Декарда, вынужденного разыскивать и уничтожать сбежавших репликантов — человекоподобных биороботов, искусственно созданных для выполнения тяжёлых и опасных работ.\nФильм существует в семи версиях, из которых базовыми считаются две — оригинальная версия с хэппи-эндом (1982), которая была плохо принята кинокритиками и провалилась в прокате, и так называемая режиссёрская версия с открытым финалом (1992), которая согласно опросу шестидесяти учёных, проведённому британской газетой The Guardian, была признана лучшим научно-фантастическим фильмом в истории.\nОсновным мотивом фильма является вопрос «Человек или репликант?». Этим вопросом задаётся Декард, разыскивая репликантов, а затем тестируя Рейчел, которая не подозревает о том, кто она. Этот вопрос он задаёт и себе. Этим же вопросом задаются зрители после просмотра кинофильма.\nФильм вышел в прокат 25 июня 1982 года и, несмотря на то, что студия считала этот день счастливым, он провалился в прокате, собрав в первый уик-энд всего 6,15 млн долларов.\nОдни обозреватели посчитали, что благодаря визуальным эффектам совсем не видно сюжетной линии, другие критиковали неспешное повествование, считая, что фильм не соответствует критериям приключенческого боевика, а третьи посчитали, что этот фильм выдержит испытание временем. Картина выиграла премию «Хьюго» за лучшую постановку, приобретя статус культовой, став ярким образцом фильма в жанре «Киберпанк» и представителем направления неонуар. В 1993 году фильм вошёл в «Национальный реестр фильмов» Библиотеки Конгресса США.", "sources_count": 1, "entities": ["Blade Runner)", "The Guardian,", "Харрисон Форд, Шон", "Ридли Скоттом", "Филипа Дика", "Библиотеки Конгресса США.", "Кэссиди, Брайон Джеймс.", "Лос-Анджелеса Рика Декарда,", "Янг, Рутгер Хауэр,", "Дэрил Ханна, Джоанна", "Эдвард Джеймс Олмос,"]}