{"content": "«Бойцо́вский клуб» (англ. Fight Club) — американский психологический триллер 1999 года режиссёра Дэвида Финчера по мотивам одноимённого романа Чака Паланика, вышедшего тремя годами ранее. Главные роли исполнили Эдвард Нортон, Брэд Питт и Хелена Бонэм Картер. Нортон сыграл роль безымянного рассказчика — обезличенного обывателя, который недоволен своей жизнью в постиндустриальном обществе потребления так называемых «белых воротничков». Он создаёт подпольную организацию «Бойцовский клуб» вместе с Тайлером Дёрденом, харизматичным и циничным бунтарём-анархистом, роль которого исполнил Брэд Питт.\nРоман Паланика был выбран продюсером Fox 2000 Pictures Лорой Зискин, которая наняла Джима Улса для написания экранизации. Финчер был выбран из-за его увлечённости историей. Он написал сценарий вместе с Ульсом и консультировался по вопросам написания сценария с актёрами и другими представителями киноиндустрии. Фильм снимался в Лос-Анджелесе и его окрестностях с июля по декабрь 1998 года. Он и актёры сравнивали фильм с фильмами «Бунтарь без причины» (1955) и «Выпускник» (1967), поднимая тему конфликта между поколением X и системой ценностей рекламы. \nРуководству студии фильм не понравился, и оно реструктурировало маркетинговую кампанию Финчера, чтобы попытаться сократить ожидаемые убытки. Премьера «Бойцовского клуба» состоялась на 56-м Венецианском международном кинофестивале 10 сентября 1999 года, а в США он был выпущен 15 октября 1999 года компанией 20th Century Fox. Фильм не оправдал ожиданий студии в прокате и вызвал неоднозначную реакцию критиков. Он был признан одним из самых спорных и обсуждаемых фильмов 1990-х годов. Однако позже «Бойцовский клуб» добился коммерческого успеха благодаря выходу на домашнем видео, став культовой классикой и заставив СМИ вернуться к нему. В 2009 году, в десятую годовщину, газета The New York Times назвала его «определяющим культовым фильмом нашего времени». \nОн числится в двадцатке лучших фильмов по версии IMDb и входит во многие другие подобны", "sources_count": 1, "entities": ["Джима Улса", "Хелена Бонэм Картер.", "Брэд Питт. Роман", "Дэвида Финчера", "Century Fox. Фильм", "Тайлером Дёрденом,", "Pictures Лорой Зискин,", "Чака Паланика,", "The New York", "Fight Club)", "Эдвард Нортон, Брэд"]}