{"content": "Боеви́к:\n\nБоевик — член незаконного вооруженного формирования (банды, террористической группы, боевой дружины в боевой организации).\nБоевик — тип самолёта для штурмовки наземных целей, в соответствии с уставом Красной армии (1928 год), позже штурмовик.\nБоевик — жанр художественных произведений, в которых большое внимание уделяется битвам, перестрелкам, дракам, погоням.\nБоевик — жанр кинематографа.\nБоевик — жанр компьютерных игр.\nТопонимы\n\nБоевик — село в Брянской области.\nБоевик — деревня в Ивановском районе Ивановской области.\nБоевик — село в Жамбылском районе Северо-Казахстанской области, ликвидировано в 2000-е годы.\n\nБоинг 747 (англ. Boeing 747) — семейство четырёхдвигательных двухпалубных широкофюзеляжных дальнемагистральных авиалайнеров, производившихся компанией Boeing Commercial Airplanes с 1968 по 2022 год. Первый полёт был выполнен 9 февраля 1969 года. На момент своего создания Боинг 747 был самым большим, тяжёлым и вместительным пассажирским авиалайнером, оставаясь таковым в течение 36 лет, до появления A380, первый полёт которого состоялся в 2005 году. Во время операции «Соломон» 24 мая 1991 года «Боинг-747» авиакомпании El Al (борт 4X-AXD) перевёз в Израиль за один полёт 1135 пассажиров.\nБоинг 747 имеет двухпалубную компоновку, при этом верхняя палуба значительно уступает по длине нижней. Размеры и своеобразный «горб» верхней палубы сделали Боинг 747 одним из наиболее узнаваемых самолётов в мире.\nСуществует несколько различных вариантов Боинга 747, большинство из которых может совершать перелёты большой дальности. Рекордсменом среди 747 является Боинг австралийской авиакомпании Qantas Airways, совершивший в 1989 году беспосадочный перелёт из Лондона в Сидней, преодолев тем самым 18 000 км за 20 часов 9 минут, не имея на борту ни пассажиров, ни груза.\nНесмотря на высокую стоимость, благодаря высокой экономичности массовых авиаперевозок и лизинговым схемам эксплуатации это один из самых распространённых в мире широкофюзеляжных пассажирских самолётов.\nВсего", "sources_count": 3, "entities": ["Vietnam War, Gulf", "Davis-Monthan AFB Boneyard.", "X-15, X-24, X-38,", "Cold War", "Northrop Grumman B-2", "U.S. Air Force", "Mach-2+ Convair B-58", "Боеви́к: Боевик", "Convair B-36 Peacemaker.", "The B-52", "Joint Direct Attack", "The B-52H", "Strategic Air Command", "Afghanistan. In", "Atlas Air,", "Spirit. The B-52", "Islamic State", "United States Air", "Bomb Wing),", "Air Force Global"]}