{"content": "Брат (также полноро́дный или родно́й брат) — мальчик/мужчина по отношению к другому ребёнку (детям) своих родителей:\n\nСтарший брат — мальчик/мужчина по отношению к более младшему ребёнку (детям) своих родителей.\nМладший брат — мальчик/мужчина по отношению к более старшему ребёнку (детям) своих родителей.\nПривенчанный брат (устар.) — брат, рождённый до брака родителей и ими признанный.\nЕдиноутро́бный брат (одноутро́бный) — мальчик/мужчина по отношению к другому ребёнку своей матери, но от другого отца.\nЕдинокро́вный брат (однородный) — происходящий от одного отца, но разных матерей.\nСво́дный брат — это состояние родства, возникающее при вступлении двух родителей в повторный для каждого из них обоих брак, между их детьми от предыдущих браков. Другими словами, у сводных братьев/сестёр нет общих родителей и их связывает семейное отношение, но не биологическое родство.\nДвоюродный брат (или кузен, от фр. cousin), — мальчик/мужчина по отношению к ребёнку дяди или тёти = сын дяди или тёти.\nСлово «брат» восходит к индоевропейскому корню, этимология которого современными исследованиями отклоняется как недоказуемая. Корень изначально обозначал членов мужского союза, братства или всех родичей мужского пола и лишь впоследствии в диалектах был переосмыслен для обозначения кровного родства: кровного брата. Переосмысление происходило неоднородно, поэтому в греческом сохранилось значение φράτωρ - «член братства», а кровного брата обозначает описательный термин άδελφός , буквально — единоутробный. Такая же ситуация сохранилась в осетинском языке.\n\n\n\nBrat (с англ. — «Оторва») — шестой студийный альбом британской певицы и автора песен Charli XCX, выпущенный 7 июня 2024 года. Чарли анонсировала альбом 28 февраля 2024 года, всего за день до выхода первого сингла, «Von Dutch». Второй сингл из альбома, «360», вышел 10 мая 2024 года. Альбом получил две премии «Грэмми» в номинациях «Лучший электронный и танцевальный альбом» и «Лучшая упаковка пластинки» в 2025 году.\nCharli XCX описала альбом", "sources_count": 2, "entities": ["США Камалой Харрис", "Charli XCX", "It’s Completely Different", "Metacritic. Делюкс-версия", "Dutch». Второй", "Also Still Brat", "Charli XCX,"]}