{"content": "«Брат 2» — российская криминальная драма 2000 года режиссёра Алексея Балабанова с Сергеем Бодровым-младшим в главной роли.\nФильм является прямым продолжением фильма «Брат», вышедшего тремя годами ранее.\nБывший военный Данила Багров сохраняет верность светлым идеалам, несмотря на лихие повороты жизни. Лучший друг обратился к нему за помощью, из-за чего Даниле приходится отправиться в Америку, чтобы выручить его. В дорогу с собой он берёт своего старшего брата Виктора, роль которого, как и в прошлом фильме, исполняет Виктор Сухоруков.\nПервоначальный прокат фильма оказался не слишком удачным. Сборы составили около 1,7 миллиона долларов при бюджете в 1,5 миллиона. Фильм получил преимущественно положительные отзывы от критиков. Они отмечали отличную игру актёров, глубину сюжета и реализацию образов России и США. Особое внимание было уделено музыке картины. Саундтрек состоит из песен российских и зарубежных исполнителей, которые идеально подчеркивают эмоциональное состояние героев и атмосферу фильма. «Брат 2» стал неотъемлемой частью российской культуры и оказал сильное влияние на развитие отечественного кино.\n24 марта 2022 года фильм был выпущен в повторный прокат в России.\n\nBrat (с англ. — «Оторва») — шестой студийный альбом британской певицы и автора песен Charli XCX, выпущенный 7 июня 2024 года. Чарли анонсировала альбом 28 февраля 2024 года, всего за день до выхода первого сингла, «Von Dutch». Второй сингл из альбома, «360», вышел 10 мая 2024 года. Альбом получил две премии «Грэмми» в номинациях «Лучший электронный и танцевальный альбом» и «Лучшая упаковка пластинки» в 2025 году.\nCharli XCX описала альбом как агрессивный и конфронтационный. Brat получил признание музыкальных критиков, многие из которых отметили уязвимость исполнительницы, отражённую в текстах. По состоянию на июнь 2024 года, это самый высокорейтинговый альбом 2024 года на Metacritic.\nДелюкс-версия с тремя дополнительными треками, озаглавленная Brat and it’s the same but there’s three more songs so it", "sources_count": 2, "entities": ["США Камалой Харрис", "Charli XCX", "Сергеем Бодровым-младшим", "It’s Completely Different", "Metacritic. Делюкс-версия", "Also Still Brat", "Dutch». Второй", "Алексея Балабанова", "России. Brat", "Данила Багров", "Виктор Сухоруков. Первоначальный", "Charli XCX,", "США. Особое"]}