{"content": "Ве́стерн (англ. western, букв.: «западный») — направление искусства, характерное для США. Действие в вестернах в основном происходит во второй половине XIX века на Диком Западе — в будущих западных штатах США, а также в Западной Канаде и Северной Мексике. Вестерн может включать в себя художественные свойства различных жанров, например, комедию, боевик, детектив, триллер и даже фантастику (см. космический вестерн). Впервые появился в художественной литературе, живописи XIX века. В начале XX века был адаптирован для кинематографа, а затем для телевидения и других видов искусства. В качестве кинематографического жанра распространился из США на другие страны, которые постепенно создали свои собственные версии жанра на основе вестерна.\nНаибольший расцвет вестерна пришёлся на середину XX века. Во второй половине XX века был заметен некоторый спад интереса к жанру, однако производство американских вестернов и их аналогов в других странах продолжается.\nПримыкает к вестерну аргентинская литература гаучо и рассказы о европейских поселенцах в Австралии.\nВестерн, кроме литературного, изобразительного и ТВ-искусства — стиль верховой езды и вид конного спорта, широко распространённый во всём мире, особенно в США. Вестерн (конный спорт) состоит из множества дисциплин, а соревнования собирают огромное количество участников и зрителей.\n\nVespertine (англ. Вечерний) — четвёртый студийный альбом исландской певицы Бьорк, выпущенный 27 августа 2001 года в Великобритании лейблом One Little Indian Records и в Соединённых Штатах лейблом Elektra Entertainment. Работа над альбомом началась во время съёмок фильма «Танцующая в темноте», которые характеризовались конфликтом между ней и режиссёром Ларсом фон Триером. На Vespertine Бьорк стремилась передать интимное и домашнее чувство, отклоняясь от более дерзкого звучания её предыдущего студийного альбома Homogenic (1997 г.).\nМузыкальный стиль альбома отразил недавно обнаруженный интерес Бьорк к минимальной и сложной электронной музыке таких прод", "sources_count": 3, "entities": ["Сары Кейн", "Miami. Newcomb", "Великобритании. Он", "Matmos Бьорк", "Э.Э. Каммингса", "Триером. На Vespertine", "Диком Западе", "Канаде, Франции", "Мэтью Барни;", "Зину Паркинс, Matmos", "Elektra Entertainment. Работа", "Западной Канаде", "США. Действие", "Соединённом Королевстве. С", "One Little Indian", "Соединённых Штатах", "Vester Newcomb", "Австралии. Вестерн,", "США. Вестерн", "Opiate, Console"]}