{"content": "Детекти́вные произведения, также уголо́вный рассказ (от лат. detectio «раскрытие», англ. detect «открывать, обнаруживать»; detective «сыщик»), — преимущественно литературный и кинематографический жанр, описывающий процесс исследования загадочного происшествия с целью выяснения его обстоятельств и раскрытия загадки. Обычно в качестве такого происшествия выступает преступление, и детектив описывает его расследование и определение виновных: в таком случае конфликт строится на столкновении справедливости с беззаконием, завершающимся победой справедливости. Детективы считаются одним из видов криминальной прозы.\n\nDetektivbyrån (Детекти́вбюро́н, со швед. — «Детективное агентство») — шведское трио из города Гётеборга, исполнявшее электронную и фольклорную музыку в период с 2005 по 2010 годы. В состав группы входили Андерс Молин («Flanders»), Юн Нильс Эмануэль Экстрём и Мартин Молин («MacGyver»).\n\nDetektivbyrån (\"The Detective Agency\") was a Swedish electronica and folk music trio from Karlstad. The group consisted of Anders \"Flanders\" Molin (accordion, music box), Martin \"MacGyver\" Molin (glockenspiel, traktofon, Toy piano, Theremin), Jon Nils Emanuel Ekström (drums, sound box, small bells), and later on, Marcus Sjöberg (drums).\nThe three members grew up in the city of Karlstad, Sweden, located in Värmland County, but they did not form a band until they had moved to Gothenburg in 2005. The usage of more unusual instruments such as the accordion was inspired both by its prominent use in the soundtrack for Amélie as well as musical traditions in Värmland. As the band also played as street musicians there was originally also a requirement to have portable instruments such as the glockenspiel.\nBetween 2006 and 2008 the band toured extensively and also participated in several Swedish radio and TV shows including a program at MTV Europe.\nOn 3 September 2008 Detektivbyrån released their first full-length album, Wermland. The band was nominated for two Grammis awards, as newcomer o", "sources_count": 3, "entities": ["Värmland. As", "MTV Europe. On", "Мартин Молин", "Tenure. In August", "Detektivbyrån. In September", "Wermland. The", "Jon Nils Emanuel", "Theremin), Jon Nils", "Karlstad. The", "Detective Agency\")", "Нильс Эмануэль Экстрём", "Karlstad, Sweden,", "Emanuel Ekström", "Marcus Sjöberg", "Värmland County,", "Андерс Молин"]}