{"content": "Drama — десятый студийный альбом прогрессив-рок-группы Yes, выпущенный в августе 1980 года лейблом Atlantic Records. Создан в апреле — июне 1980 года.\nПервый альбом группы, записанный без участия вокалиста Джона Андерсона. В начале 1980 года, после серии репетиций, кроме Андерсона группу покинул также и клавишник Рик Уэйкман.\nDrama является единственным альбомом с Тревором Хорном в качестве ведущего вокалиста (он позднее будет участвовать в качестве продюсера альбомов 90125 и Fly from Here и первым (перед Fly from Here) альбомом для клавишника Джеффри Даунса.\nПосле записи Drama группа распалась, чтобы собраться в новом составе уже через два года.\n\nDrama is the specific mode of fiction represented in performance: a play, opera, mime, ballet, etc., performed in a theatre, or on radio or television. Considered as a genre of poetry in general, the dramatic mode has been contrasted with the epic and the lyrical modes ever since Aristotle's Poetics (c. 335 BC)—the earliest work of dramatic theory.\nThe term \"drama\" comes from a Greek word meaning \"deed\" or \"act\" (δρᾶμα, drâma), which is derived from \"I do\" (δράω, dráō). The two masks associated with drama represent the traditional generic division between comedy and tragedy.\nIn English (as was the analogous case in many other European languages), the word play or game (translating the Anglo-Saxon pleġan or Latin ludus) was the standard term for dramas until William Shakespeare's time—just as its creator was a play-maker rather than a dramatist and the building was a play-house rather than a theatre.\nThe use of \"drama\" in a more narrow sense to designate a specific type of play dates from the modern era. \"Drama\" in this sense refers to a play that is neither a comedy nor a tragedy—for example, Zola's Thérèse Raquin (1873) or Chekhov's Ivanov (1887). It is this narrower sense that the film and television industries, along with film studies, adopted to describe \"drama\" as a genre within their respective media. The term \"radio", "sources_count": 2, "entities": ["Джеффри Даунса. После", "Japanese Nō,", "Aristotle Poetics", "Тревором Хорном", "Chekhov Ivanov", "Atlantic Records. Создан", "Джона Андерсона. В", "William Shakespeare", "Рик Уэйкман. Drama", "Zola Thérèse Raquin"]}