{"content": "«Интерсте́ллар» (англ. Interstellar — «Межзвёздный») — эпическая научная фантастика 2014 года, девятый полнометражный фильм режиссёра Кристофера Нолана, который написал сценарий в соавторстве со своим братом Джонатаном. В фильме задействован актёрский ансамбль во главе с Мэттью Макконахи, Энн Хэтэуэй, Джессикой Честейн, Биллом Ирвином, Эллен Бёрстин и Майклом Кейном. Действие фильма разворачивается в антиутопическом будущем, где Земля страдает от катастрофического упадка и голода. Фильм рассказывает о группе астронавтов, которые путешествуют через кротовую нору вблизи Сатурна в поисках нового дома для человечества.\nВ основу сценария был положен сценарий, разработанный Джонатаном в 2007 году, режиссёром которого первоначально должен был стать Стивен Спилберг. Физик-теоретик Кип Торн был исполнительным продюсером и научным консультантом фильма, а также написал книгу «Интерстеллар. Наука за кадром». Это был последний фильм Линды Обст в качестве продюсера перед её смертью. Оператор Хойте ван Хойтема снял его на 35-мм киноплёнку в анаморфотном киноформате Panavision и 70-мм IMAX. Съемки начались в конце 2013 года и проходили в Альберте, Киркьюбайярклёйстюре и Лос-Анджелесе. В фильме «Интерстеллар» широко используются практические и миниатюрные эффекты, а компания DNEG создала дополнительные визуальные эффекты.\nПремьера фильма состоялась в Китайском театре TCL 26 октября 2014 года, а в кинотеатрах США он был выпущен 5 ноября, а в Великобритании — 7 ноября. В США он был впервые выпущен на кинорынках, а затем распространился на площадки, оснащённые цифровыми проекторами. Фильм получил в целом положительные отзывы критиков и имел коммерческий успех, собрав в мировом прокате 681 миллион долларов во время первого показа в кинотеатрах и 758,6 миллиона долларов в последующих прокатах, что сделало его десятым самым кассовым фильмом 2014 года. Помимо различных наград, «Интерстеллар» был номинирован на пять премий на 87-й церемонии вручения премии «Оскар» и получил статуэтку в номи", "sources_count": 1, "entities": ["Хэтэуэй, Джессикой Честейн,", "Альберте, Киркьюбайярклёйстюре", "Мэттью Макконахи, Энн", "Кристофера Нолана,", "Лос-Анджелесе. В", "Оператор Хойте", "Кип Торн", "Линды Обст", "Биллом Ирвином, Эллен", "Майклом Кейном. Действие", "Джонатаном. В", "Стивен Спилберг. Физик-теоретик", "IMAX. Съемки"]}