{"content": "Сильвия Коста Акоста (исп. Silvia Costa Acosta; род. 4 мая 1964, Ла-Пальма, Пинар-дель-Рио), в замужестве Мартинес (исп. Martínez) и Санлеандро (исп. Sanleandro) — кубинская легкоатлетка, специалистка по прыжкам в высоту. Выступала за сборную Кубы по лёгкой атлетике в 1978—1996 годах, победительница Игр доброй воли, обладательница серебряной медали чемпионата мира, бронзовая призёрка Всемирных легкоатлетических игр, серебряная призёрка Панамериканских игр, чемпионка Всемирной Универсиады, двукратная чемпионка Центральноамериканских и Карибских игр, многократная чемпионка Кубы, действующая рекордсменка страны, участница летних Олимпийских игр в Барселоне.\n\nKate Stilley Steiner is an American filmmaker, editor, and producer who has worked in documentary filmmaking since 1990. She co-founded Citizen Film, a San Francisco-based not-for-profit production company which \"creates films and online media that foster active engagement in cultural and civic life.\" Stilley’s work has been broadcast on PBS, ABC, NBC, The Learning Channel, and Fox.\nStilley co-founded Citizen Film in 2002 with Sam Ball and Sophie Constantinou. She has produced a number of films with Citizen Film, including Throwing Curves: Eva Zeisel (2002), Balancing Acts: A Jewish Theater in the Soviet Union (2009), and American Creed (2018). She edited Wendy MacNaughton Draws the Castro Commons (2012), People of the Graphic Novel (2012), and served as consulting editor on PBS broadcast Joann Sfar Draws from Memory (2012). Kate Stilley collaborated with brother and artist Tucker Stilley and the Cohort of Disembodied Artists to produce and curate “Palimpsessed,” an art exhibit on Virtual Ability Island in Second Life. \nFrom 1999 through 2021, Stilley worked on a number of films with Academy award-winning director Debra Chasnoff and her production company GroundSpark. In 1999, she edited Wired For What? as part of the PBS series Digital Divide which examines elementary schools grappling with computerization. In 200", "sources_count": 2, "entities": ["Graphic Novel", "Jewish Theater", "Groundspark Legacy Initiative", "Throwing Curves: Eva", "Let’s Get Real,", "One Wedding", "PBS, ABC, NBC,", "Debra Chasnoff", "Fox. Stilley", "Castro Commons", "It’s Elementary: Talking", "White House", "Kate Stilley Steiner", "American Creed", "Second Life. From", "Television Emmy Award-winning", "Following Chasnoff’s", "Betrayal: The Story", "Del Martin", "ABC Television; Fox"]}