{"content": "«Казино» (англ. Casino) — эпическая криминальная драма 1995 года, пятнадцатый полнометражный фильм режиссёра Мартина Скорсезе, экранизированная Скорсезе и Николасом Пиледжи по научно-популярной книге последнего Казино: любовь и честь в Лас-Вегасе. В главных ролях снимались Роберт Де Ниро, Шэрон Стоун, Джо Пеши, Дон Риклс, Кевин Поллак и Джеймс Вудс. Фильм стал восьмой совместной работой режиссёра Скорсезе и Де Ниро.\nФильм рассказывает о Сэме «Тузе» Ротштейне (Де Ниро), американском еврее, специалисте по азартным играм, гандикапере, которого Чикагский филиал попросил наблюдать за повседневной работой казино и отелей в казино Tangiers в Лас-Вегасе. Среди других главных героев — Ники Санторо (Пеши), «состоявшийся человек» и друг Сэма, и Джинджер Маккенна (Стоун), уличная мошенница, на которой Сэм женится и у них рождается дочь. В фильме подробно рассказывается о том, как Сэм управляет казино, о трудностях, с которыми он сталкивается на работе, о причастности мафии к казино и о постепенном разрушении его связей и репутации по мере того, как Лас-Вегас меняется с годами.\nГлавные герои основаны на реальных людях: Сэм вдохновлён жизнью Фрэнка Розенталя, также известного как «Левша», который управлял казино Stardust, Fremont, Marina и Hacienda в Лас-Вегасе для чикагской компании с 1968 по 1981 год. Ники и Джинджер созданы по мотивам гангстера Энтони Спилотро и бывшей танцовщицы и светской львицы Джери Макги соответственно.\nФильм Казино был выпущен 22 ноября 1995 года студией Universal Pictures, получил в основном положительные отзывы критиков и имел успех в мировом прокате. Игра Стоун получила признание, принеся ей премию «Золотой глобус» за лучшую женскую роль — драма и номинацию на премию «Оскар» за лучшую женскую роль.\n\n«Kinofilm» Lwów — польская киностудия, находившаяся в г. Львове и действовавшая до начала второй мировой войны в 1939 году.\n\nKano is a 2014 Taiwanese baseball period film directed by Umin Boya and produced by Jimmy Huang and Wei Te-sheng. It is based on a ", "sources_count": 3, "entities": ["Лас-Вегасе. В", "Stardust, Fremont, Marina", "Koshien Stadium", "Osaka Asian Film", "Пеши, Дон Риклс,", "Golden Horse Film", "Фрэнка Розенталя,", "Игра Стоун", "Jimmy Huang", "Audience Awards", "Wei Te-sheng. It", "Masatoshi Nagase", "Лас-Вегасе. Среди", "Best Supporting Actor", "Japanese High School", "Ниро. Фильм", "Festival. Kano", "Umin Boya", "Джери Макги", "Шэрон Стоун, Джо"]}