{"content": "Киберпа́нк (англ. cyberpunk [ˈsaɪbə(r)ˌpʰʌŋk]) — поджанр научной фантастики, отражающий упадок человеческой культуры на фоне технологического прогресса в компьютерную эпоху. Сам термин является соединением префикса cyber- (от англ. cybernetics «кибернетика») и англ. punk «панк», впервые его использовал Брюс Бетке в качестве названия для своего рассказа 1983 года. Произведения, относимые к жанру «киберпанк», описывают антиутопический мир будущего, в котором развитые информационные технологии и кибернетика, виртуальная реальность, киборгизация, искусственный интеллект, сочетается со всеобъемлющим, чрезмерным, неограниченным и нерегулируемым государственным контролем за обществом (тоталитаризм, авторитаризм или даже фашизм в сочетании с алгократией и киберократией), либо наоборот упадком, коррупцией, разложением государственных институтов, клептократией, в сочетании с доминированием гигантских транснациональных корпораций, мафии, социального неравенства, бедности или радикальными переменами в социальном устройстве самого общества. Произведения киберпанка часто поднимают вопросы сущности человеческого разума и общества, грани между человеком и машиной, реальностью и виртуальностью, и проблему ярко выраженного социального расслоения между бедными и богатыми.\n\nKibera Kid is a short film set in the Kibera slums in Nairobi, Kenya. It was written, directed and co-produced by Nathan Collett in collaboration with the locals of Kibera.\nIt gives a balanced view of life in the slum and the choices which youth face. Everyday life is shown is small touches, such as the opening scene with the children running to hear the Kibera Kid rap, the potatoes frying in a large pan, and the young girl peering through the hole in the wall to see what is going on. \nThe cinematography give the viewer a sense of being present in the slum. The living conditions are neither sensationalized nor sentimentalized. The acting, especially by the lead actor, Ignatius Juma is outstanding. The location, the ", "sources_count": 2, "entities": ["Berlin Film Festival", "Nathan Collett", "Student Emmy", "BBC, Reuters", "Hot Sun Foundation", "Брюс Бетке", "Jazeera English. In", "Kibera Kid", "Ignatius Juma", "Kibera. It", "Hollywood. It", "Nairobi, Kenya. It"]}