{"content": "«Крёстный оте́ц» (англ. The Godfather) — американский криминальный драматический фильм 1972 года режиссёра Фрэнсиса Форда Копполы, который был соавтором сценария с Марио Пьюзо, основанный на одноимённом романе Пьюзо. В главных ролях Марлон Брандо, Аль Пачино, Джеймс Каан, Ричард Кастеллано, Роберт Дюваль, Стерлинг Хэйден, Джон Марли, Ричард Конте и Дайан Китон. Это первый фильм одноимённой трилогии, в которой рассказывается о семье Корлеоне при патриархе Вито Корлеоне с 1945 по 1955 год. Он фокусируется на превращении его младшего сына, Майкла Корлеоне, отдалившегося от дел семьи, в безжалостного мафиозного босса.\nParamount Pictures получила права на роман за 80 000 долларов, прежде чем он приобрёл популярность. У руководителей студии были проблемы с поиском режиссёра; первые несколько кандидатов отказались от должности до того, как Коппола подписал контракт на режиссуру фильма, но последовали разногласия по поводу кастинга нескольких персонажей, в частности, Вито и Майкла. Съёмки проходили в основном в Нью-Йорке и на Сицилии и были завершены досрочно. Музыка была написана в основном Нино Ротой, дополнительная — Кармайном Копполой.\nПремьера фильма состоялась 14 марта 1972 года в Государственном театре Лоу и 24 марта в США. Это был самый кассовый фильм 1972 года и на некоторое время стал самым кассовым фильмом всех времён, заработав от 250 до 291 миллиона долларов. Лента получила всеобщее признание критиков и зрителей, которые хвалили актёров, особенно Брандо и Пачино, режиссуру, сценарий, съёмку, монтаж, музыку, а также изображение мафии. Фильм выступил катализатором успешной карьеры Копполы, Пачино и других относительных новичков в актёрском составе и съёмочной группе. «Крёстный отец» также оживил карьеру Брандо, клонившейся к упадку в 1960-х годах, и актёр продолжил сниматься в таких фильмах, как «Последнее танго в Париже», «Супермен» и «Апокалипсис сегодня». На 45-й церемонии вручения премии «Оскар» лента получила награду за лучший фильм, лучшую мужскую роль (Бра", "sources_count": 1, "entities": ["Марлон Брандо, Аль", "Дюваль, Стерлинг Хэйден,", "Джон Марли, Ричард", "Paramount Pictures", "США. Это", "Пачино, Джеймс Каан,", "Майкла. Съёмки", "The Godfather)", "Майкла Корлеоне,", "Дайан Китон. Это", "Пьюзо. В", "Копполы, Пачино", "Фрэнсиса Форда Копполы,", "Ричард Кастеллано, Роберт", "Марио Пьюзо,", "Нино Ротой,", "Кармайном Копполой. Премьера", "Вито Корлеоне"]}