{"content": "«Кримина́льное чти́во» (англ. Pulp Fiction — «Бульварное чтиво») — культовый кинофильм режиссёра Квентина Тарантино. Сюжет фильма построен нелинейно, как и в большинстве других работ Тарантино. Этот приём стал чрезвычайно популярен, вызвав множество подражаний во второй половине 1990-х годов. Фильм объединяет несколько историй: ограбление кафе, философские беседы двух гангстеров, спасение девушки от передозировки героином и боксёр, которого задели за живое. Название отсылает к популярным в середине XX века в США pulp-журналам, стилистика которых использовалась при создании афиш, а позднее — саундтрека, видеокассет и DVD с фильмом.\nФильм стабильно занимает место в первой десятке списка 250 лучших фильмов на сайте IMDb. Удостоен премии «Оскар», «BAFTA» и «Золотой глобус» в категории «Лучший оригинальный сценарий», «Золотой пальмовой ветви» Каннского кинофестиваля 1994 года и более сорока других кинематографических наград. Картина имела большой успех у зрителей и считается важной вехой в истории кинематографа, давшей ощутимый толчок развитию независимого американского кино.\n«Криминальное чтиво» считается шедевром Тарантино благодаря своему сценарию. Критики отметили его саморефлексивность, нетрадиционную структуру и особенную стилизацию, назвав фильм образцом постмодернистского кино. Он часто воспринимается как культурное явление, оказавшее влияние на кино и другие медиа, которые переняли элементы его стиля. Актёрский состав также получил широкую похвалу, а Тарантино получил особое признание. В 2008 году журнал Entertainment Weekly назвал «Криминальное чтиво» лучшим фильмом с 1983 года. Картина многократно попадала в различные списки величайших фильмов всех времён. В 2013 году фильм был включён Библиотекой Конгресса США в Национальный реестр фильмов как культурно, исторически или эстетически значимое произведение.", "sources_count": 1, "entities": ["Pulp Fiction", "Тарантино. Этот", "Entertainment Weekly", "Библиотекой Конгресса США", "Квентина Тарантино. Сюжет", "IMDb. Удостоен"]}