{"content": "«Матрица» (англ. The Matrix) — научно-фантастический боевик, поставленный братьями Вачовски по собственному сценарию и спродюсированный Джоэлом Сильвером. Главные роли исполнили Киану Ривз, Лоренс Фишберн, Керри-Энн Мосс и Хьюго Уивинг. Фильм вышел на экраны в США 31 марта 1999 года и послужил созданию одноимённой медиафраншизы, в которую вошли ещё три фильма, комиксы, компьютерные игры и аниме.\nФильм изображает будущее, в котором реальность, существующая для большинства людей, является в действительности симуляцией типа «мозг в колбе», созданной разумными машинами, чтобы подчинить и усмирить человеческое население, в то время как тепло и электрическая активность их тел используются машинами в качестве источника энергии. Привлечённый повстанцами против машин хакер по кличке Нео с помощью Тринити и Морфеуса оказывается в новом, пугающем реальном мире. Он проходит выбор — вернуться к существованию в симуляции, либо начать повстанческую борьбу против машин, в которую также вовлечены другие люди, освободившиеся из «мира снов» и выбравшиеся в реальность. Он выбирает борьбу.\nКартина вызвала значительный резонанс в сфере философской мысли, обсуждению её аллегорического смысла посвящены многочисленные статьи. Наиболее полное соответствие идее «Матрицы» находят в платоновском мифе о Пещере; кроме того, в фильме содержится целый ряд философских, религиозных и художественных реминисценций. Среди возможных источников вдохновения для создания фильма также называются гностицизм, киберпанк и хакерская субкультура, «Алиса в Стране чудес», повесть Айзека Азимова «Профессия», роман Артура Кларка «Город и звёзды», гонконгские боевики и аниме «Призрак в доспехах».\nТакже возможным прототипом сюжета является двухсерийный телефильм «Мир на проводе», основанный на романе Дэниела Галуйе «Симулакрон-3». Вольной экранизацией этого же романа является фильм «13 этаж», вышедший в том же 1999 году и номинировавшийся вместе с «Матрицей» на премию «Сатурн». Также следует упомянуть малобюджетный фил", "sources_count": 1, "entities": ["Джоэлом Сильвером. Главные", "Robot Holocaust)", "Артура Кларка", "The Matrix)", "Фишберн, Керри-Энн Мосс", "Айзека Азимова", "Хьюго Уивинг. Фильм", "Дэниела Галуйе", "Киану Ривз, Лоренс", "Матрицы». В"]}