{"content": "Ма́трица (лат. matrix — «источник», а также «архив», «журнал записей»):\nМатрица — сфера применения, взаимодействия.\n\nМатрица в научной фантастике и философии — условное название компьютерной симуляции, которой, возможно, является наша материальная Вселенная (по названию американского научно-фантастического боевика в котором была показана такая симуляция).\nМа́трица в математике — объект, записываемый в виде прямоугольной таблицы элементов кольца или поля, которая представляет собой совокупность строк и столбцов, на пересечении которых находятся её элементы.\nМатрица в физике — конденсированная среда, в которую помещаются изолированные активные частицы с целью предотвращения взаимодействия между собой и с окружающей средой.\nMatrix — открытый протокол мгновенного обмена сообщениями.\n\nMatriarch — пятый студийный альбом группы Veil of Maya. Это первый альбом, в записи которого принял участие вокалист Лукас Магьяр. Альбом был спродюсирован и сведён Тейлором Ларсоном из группы From First to Last. В отличие от предыдущих альбомов, в нём содержится больше звучание современного металкора, нежели дэткора.\nСингл «Phoenix» вышел 1 января 2015 года. До выхода песни на своих страницах в социальных сетях группа разместила хэштэг «VeilHasRisen». Музыкальный клип на песню «Mikasa» вышел 23 марта 2015 года, в то же время было объявлено название и дата релиза альбома. Альбом стал доступен для прослушивания онлайн 11 мая 2015.\n\nMatriarchy is a social system in which positions of power and privilege are held by women. In a broader sense it can also extend to moral authority, social privilege, and control of property. While those definitions apply in general English, definitions specific to anthropology and feminism differ in some respects.\nMatriarchies may also be confused with matrilineal, matrilocal, and matrifocal societies. While some may consider any non-patriarchal system to be matriarchal, most academics exclude those systems from matriarchies as strictly defined. Many societies ha", "sources_count": 3, "entities": ["Лукас Магьяр. Альбом", "Тейлором Ларсоном", "Last. В", "From First", "Maya. Это"]}