{"content": "Martin Scorsese (born 1942) is an American film director, producer, screenwriter, actor, and film historian whose career spans more than fifty years. To date, Scorsese has directed twenty-six feature length narrative films, seventeen feature-length documentary films, and has co-directed one anthology film. His films Mean Streets (1973), Taxi Driver (1976), Raging Bull (1980), and Goodfellas (1990) are often cited among the greatest films ever made and established himself as one of the most respected directors of all time. He became known for his collaborations with actors Robert De Niro and Leonardo DiCaprio.\nScorsese started his career with the independent drama Who's That Knocking at My Door (1967) and the romance drama Boxcar Bertha (1972) before earning acclaim for his crime drama Mean Streets (1973) which was his first collaboration with Robert De Niro. He continued to earn acclaim directing films of various genres such as the romantic comedy-drama Alice Doesn't Live Here Anymore (1974), the psychological drama Taxi Driver (1976), the musical New York, New York (1977), the biographical sports drama Raging Bull (1980), the satirical black comedy The King of Comedy (1982), the black comedy After Hours (1985), the sports drama The Color of Money (1986), and the religious epic The Last Temptation of Christ (1989). After establishing himself as one of the most prominent directors, he gained acclaim throughout the 1990s by directing a string of crime films such as Goodfellas (1990), Cape Fear (1991), and Casino (1995). During this time he also directed period romance The Age of Innocence (1993), and the dramas Kundun (1997) and Bringing Out the Dead (1999).\nDuring the 2000s, Scorsese directed a string of well received epic films such as the historical drama Gangs of New York (2002), the biographical drama The Aviator (2004), and the crime thriller The Departed (2006), the latter of which won the Academy Award for Best Picture. Since the 2010s, he has directed the neo", "sources_count": 1, "entities": ["Boxcar Bertha", "Leonardo DiCaprio. Scorsese", "New York, New", "Here Anymore", "Cape Fear", "Flower Moon", "The King", "Raging Bull", "The Color", "After Hours", "Robert De Niro.", "Martin Scorsese", "The Irishman", "Who That Knocking", "Wall Street", "Taxi Driver", "The Departed", "Alice Doesnt Live", "The Aviator", "The Age"]}