{"content": "«Нача́ло» (англ. Inception, буквально — начало процесса или организации, зарождение, исток; в фильме означает «внедрение идеи») — фильм-ограбление в жанре научно-фантастического боевика 2010 года, седьмой полнометражный фильм режиссёра Кристофера Нолана, который продюсировал со своей женой Эммой Томас и основал его на идее осознанных сновидений.\nВ актёрский состав входят Кэн Ватанабэ, Джозеф Гордон-Левитт, Марион Котийяр, Эллен Пейдж, Том Харди, Киллиан Мерфи, Том Беренджер, Дилип Рао и Майкл Кейн.\nВ фильме Леонардо Ди Каприо играет профессионального вора, который крадёт информацию, проникая в подсознание своих целей. Ему предлагают снятие обвинения в убийстве его жены в США и возможность легально жить там с детьми в качестве оплаты за внедрение чужой идеи в подсознание цели. В жанровом отношении «Начало» напоминает традиционный фильм-ограбление, с той разницей, что целью является не похищение объекта, а внедрение идеи в сознание жертвы. По сюжету профессионалы промышленного шпионажа, использующие специальные приёмы для извлечения стратегически важной информации путём вторжения в сны других людей, осваивают новую технику — «внедрение» идеи в сознание человека через его сновидение. Важную роль в фильме играет технология, позволяющая нескольким людям погружаться в один и тот же сон.\n«Начало» собрало в мировом прокате более 837 млн долларов, став четвёртым по величине фильмом 2010 года. На март 2023 года фильм занимает 14-ю строчку списка 250 лучших фильмов по версии IMDb и 36-ю строчку списка 250 лучших фильмов по версии пользователей «КиноПоиска». Журнал «Мир фантастики» назвал «Начало» главным фильмом десятилетия 2010-х. На 83-й церемонии вручения премии «Оскар», фильм получил 4 премии «Оскар»: лучшая операторская работа, лучший звуковой монтаж, лучший звук, и лучшие визуальные эффекты. Фильм также получил 4 номинации на премию «Оскар», включая лучший фильм, лучший оригинальный сценарий, лучшую работу художника-постановщика и лучшую музыку к фильму.\n\n", "sources_count": 1, "entities": ["Леонардо Ди Каприо", "Гордон-Левитт, Марион Котийяр,", "Эллен Пейдж, Том", "Кэн Ватанабэ, Джозеф", "Харди, Киллиан Мерфи,", "Том Беренджер, Дилип", "Майкл Кейн. В", "Эммой Томас", "Кристофера Нолана,"]}