{"content": "Неонуа́р (neo-noir) — обозначение нуаровой волны, которая прокатилась по американским киноэкранам в первой половине 1970-х годов на фоне уотергейтских разоблачений и неудач американцев во Вьетнаме. Иногда термин распространяют и на цветные фильмы с элементами нуара, которые снимались в более поздний период.\n\nNeon Trees (с англ. — «Неоновые деревья») — американская рок-группа, была создана в 2005 году солистом Тайлером Гленном и гитаристом Крисом Алленом.\n\nNeo-Nazism comprises all social, political, and militant ideologies and movements that have professed or idealized Nazism, whether in whole or in part, since the end of World War II in 1945. Neo-Nazi individuals and organizations employ their ideology to promote what they perceive as the racial or ethnic supremacy (often White supremacy) of their own group; to incite or engage in hatred or discrimination against demographic minorities (often antisemitism and Islamophobia); and, in some cases, to establish a fascist state (e.g., \"Fourth Reich\"). Also common in neo-Nazi circles is engagement in historical negationism and propagation of conspiracy theories—not limited to absolving or glorifying the Nazi Party or those who inspired or are thought to have inspired Adolf Hitler and other prominent Nazi figures—such as Holocaust denial and Jewish war; White genocide and Great Replacement; and \"cultural\" Marxism. \nWhile mainly concentrated in the Western world, neo-Nazism is a global phenomenon and has organized representation in several international networks. However, it is not exclusive to people of European origin—many similar supremacist movements among local racial or ethnic groups in non-Western regions have been observed adhering to tenets of or inspired by neo-Nazi ideology. Much of this manifests in adopting original Nazi ideological doctrine and practices, including racism, ultra-nationalism, ableism, homophobia, and conspiratorial anti-communism, among others.\nNeo-Nazis regularly display Nazi symbols and expres", "sources_count": 3, "entities": ["World War II.", "Hitler Germany", "World War II", "Nazi Party", "Neon Trees", "Тайлером Гленном", "Крисом Алленом. Neo-Nazism", "Marxism. While", "Great Replacement;", "Вьетнаме. Иногда", "Reich\"). Also", "Adolf Hitler"]}