{"content": "Нуа́р (фр. film noir «чёрный фильм») — кинематографический термин, применяемый к голливудским криминальным драмам 1940-х — 1950-х годов, в которых запечатлена атмосфера пессимизма, недоверия, разочарования и цинизма, характерная для американского общества во время Второй мировой войны и в первые годы холодной войны.\nЭпоха классического нуара заключена между фильмами «Мальтийский сокол» (1941) и «Печать зла» (1958). На создании нуаров специализировались режиссёры Рауль Уолш, Джон Хьюстон, Роберт Сьодмак, Отто Премингер и Фриц Ланг; свой вклад в развитие жанра внесли такие крупные мастера, как Стенли Кубрик, Орсон Уэллс, Билли Уайлдер, Николас Рэй и Альфред Хичкок. Эталонные образы частных детективов и негодяев в фильмах этого направления создали Хамфри Богарт, Дэна Эндрюс, Берт Ланкастер и Орсон Уэллс. «Роковых женщин» в нуарах играли почти все голливудские кинодивы того времени, в частности Рита Хейворт, Ингрид Бергман, Джоан Кроуфорд, Лорен Бэколл, Барбара Стэнвик, Ава Гарднер и Джин Тирни.\nВ сценарном плане нуар отталкивался от американской школы «крутого детектива» (англ. hard-boiled fiction), а в отношении кинематографии многие приёмы были позаимствованы из арсенала немецкого экспрессионизма («М», а особенно «Ярость» и «Жизнь даётся один раз» Фрица Ланга). Помимо самого Ланга, многие мастера нуара (Премингер, Сьодмак, Уайлдер) прошли закалку в немецком кинематографе довоенного времени. Не исключено также влияние и французского поэтического реализма конца 1930-х годов («Пепе ле Моко»). Фильмы нуар снимались и за пределами США — в Великобритании, во Франции и в Японии.\n\nNuArt — ежегодный фестиваль уличного искусства, который традиционно проводится в сентябре в Ставангере (Норвегия) с 2001 года. Этот фестиваль является некоммерческим мероприятием, посвященным исключительно уличному искусству во всех его проявлениях.\n\nThe Nuart Theatre is an art-house movie-theater in Los Angeles, California, United States. It is the flagship location of the Landmark Theatres chain ", "sources_count": 3, "entities": ["Альфред Хичкок. Эталонные", "Николас Рэй", "Landmark Theatres", "Los Angeles, California,", "The Nuart Theatre", "Бергман, Джоан Кроуфорд,", "Рита Хейворт, Ингрид", "Хамфри Богарт, Дэна", "United States.", "Фрица Ланга). Помимо", "Фриц Ланг;", "Уэллс, Билли Уайлдер,", "Стэнвик, Ава Гарднер", "Лорен Бэколл, Барбара", "Сьодмак, Уайлдер)", "United States. It", "Орсон Уэллс.", "Стенли Кубрик, Орсон", "Моко»). Фильмы", "Эндрюс, Берт Ланкастер"]}