{"content": "Pop-punk (also punk pop, alternatively spelled without the hyphen) is a rock music genre that combines elements of punk rock and pop. It is defined by its fast-paced, energetic tempos, and emphasis on classic pop songcraft, as well as adolescent and anti-suburbia themes. It is distinguished from other punk-variant genres by drawing more heavily from 1960s bands such as the Beatles, the Kinks, and the Beach Boys. The genre has evolved throughout its history, absorbing elements from new wave, college rock, ska, hip hop, emo, boy band pop and even hardcore punk and metalcore. It is sometimes considered interchangeable with power pop and skate punk.\nThe genre's roots are found during the late 1970s with groups such as the Ramones, the Undertones, and Buzzcocks setting its initial groundwork. 1980s punk bands like Bad Religion, Descendents and the Misfits, while not necessarily pop-punk in and of themselves, were influential to pop-punk, and it expanded in the late 1980s and early 1990s by a host of bands signed to Lookout! Records, including Screeching Weasel, the Queers, and the Mr. T Experience, becoming a foundational stage. In the mid-1990s, the genre saw a widespread popularity increase and entered the mainstream with bands like Green Day and the Offspring, and by late 1990s through early 2000s, it experienced a second wave led by Blink-182, and in their wake followed contemporary acts such as Sum 41, New Found Glory, Good Charlotte, and Avril Lavigne, while the Warped Tour played a crucial role in launching up-and-coming pop-punk artists.\nPop-punk's mainstream popularity continued in the mid-to-late 2000s, with artists such as Fall Out Boy, My Chemical Romance, and Paramore achieving high levels of commercial success. By this point, pop-punk acts were largely indistinguishable from artists tagged as \"emo\", to the extent that emo crossover acts such as Fall Out Boy and Paramore popularized a pop-punk-influenced style dubbed emo pop. By the 2010s, pop-punk's mainstr", "sources_count": 1, "entities": ["Lookout! Records,", "Good Charlotte,", "Avril Lavigne,", "Fall Out Boy", "Mr. T Experience,", "Chemical Romance,", "Machine Gun Kelly,", "Wonder Years", "Fall Out Boy,", "Beach Boys. The", "Screeching Weasel,", "Bad Religion, Descendents", "Green Day", "Neck Deep. In", "New Found Glory,", "Warped Tour"]}