{"content": "«Taki Taki» — песня французского музыканта DJ Snake, записана при участии американской певицы Селены Гомес, пуэрто-риканского певца Осуны и американской хип-хоп исполнительницы Карди Би. Сингл был выпущен 28 сентября 2018 года. Выпущенный в поддержку видеоклип стал одним из десяти видеоклипов, набравших 100 миллионов просмотров за рекордное время.\n\nTaksin the Great (Thai: สมเด็จพระเจ้าตากสินมหาราช, RTGS: Somdet Phra Chao Taksin Maharat, ) or the King of Thonburi (Thai: สมเด็จพระเจ้ากรุงธนบุรี, RTGS: Somdet Phra Chao Krung Thon Buri; simplified Chinese: 郑昭; traditional Chinese: 鄭昭; pinyin: Zhèng Zhāo; Teochew: Dên Chao; 17 April 1734 – 7 April 1782) was the only king of the Thonburi Kingdom that ruled Thailand from 1767 to 1782. He had been an aristocrat in the Ayutthaya Kingdom and then was a major leader during the liberation of Siam from Burmese occupation after the Second Fall of Ayutthaya in 1767, and the subsequent unification of Siam after it fell under various warlords. He established the city of Thonburi as the new capital, as the city of Ayutthaya had been almost completely destroyed by the invaders. His reign was characterized by numerous wars; he fought to repel new Burmese invasions and to subjugate the northern Thai kingdom of Lanna, the Laotian principalities, and threatening Cambodia.\nAlthough warfare occupied most of Taksin's reign, he paid a great deal of attention to politics, administration, economy, and the welfare of the country. He promoted trade and fostered relations with foreign countries. He had roads built and canals dug. Apart from restoring and renovating temples, the king attempted to revive literature, and various branches of the arts such as drama, painting, architecture and handicrafts. He also issued regulations for the collection and arrangement of various texts to promote education and religious studies.\nHe was taken in a coup d'état and executed in 1782, and succeeded by his long-time friend Maha Ksatriyaseuk, who then assumed th", "sources_count": 2, "entities": ["Rattanakosin Kingdom", "Dên Chao;", "Селены Гомес,", "Chao Taksin Maharat,", "RTGS: Somdet Phra", "Maha Ksatriyaseuk,", "Ayutthaya Kingdom", "Chao Krung Thon", "Thonburi Kingdom", "Second Fall", "Zhèng Zhāo; Teochew:", "Cambodia. Although", "Thailand. In", "Карди Би. Сингл"]}