{"content": "«Таксист» (англ. Taxi Driver) — американская психологическая драма в стиле неонуар 1976 года, пятый полнометражный фильм, снятый Мартином Скорсезе по сценарию Пола Шредера. Действие фильма происходит в морально разлагающемся Нью-Йорке после войны во Вьетнаме. Роберт Де Ниро играет ветерана морской пехоты и таксиста Трэвиса Бикла, чьё психическое состояние ухудшается из-за того, что он работает по ночам в городе. В фильме также снимались Джоди Фостер, Сибилл Шеперд, Харви Кейтель, Питер Бойл, Леонард Харрис и Альберт Брукс (в своей первой роли в полнометражном фильме).\nПосмотрев «Не тот человек» (1956) и «Большой всплеск» (1973), Скорсезе хотел, чтобы фильм показался зрителям сном. Съёмки начались летом 1975 года, и актёрам пришлось сократить гонорары, чтобы проект мог быть завершён при его небольшом бюджете в 1,9 миллиона долларов.\nДля саундтрека Бернард Херрманн написал то, что стало его последней партитурой. Музыка была закончена всего за несколько часов до его смерти, и фильм посвящён ему.\nВыпущенный в кинотеатрах Columbia Pictures 8 февраля 1976 года, фильм имел критический и коммерческий успех, несмотря на споры как из-за его графического насилия в кульминации фильма, так и из-за кастинга 12-летней Фостер на роль малолетней проститутки. Фильм получил множество наград, включая «Золотую пальмовую ветвь» на Каннском кинофестивале 1976 года и четыре номинации на 49-й церемонии вручения премии «Оскар», включая «Лучший фильм», «Лучшая мужская роль» (Де Ниро) и «Лучшая женская роль второго плана» (Фостер).\nХотя «Таксист» вызвал дальнейшие споры из-за того, что вдохновил Джона Хинкли-младшего на покушение на президента Рональда Рейгана в 1981 году, фильм остался популярным. Он считается одним из величайших фильмов, когда-либо снятых, и одним из самых культурно значимых и вдохновляющих своего времени, получив культовый статус.\nВ 2022 году Sight & Sound назвал его 29-м лучшим фильмом в своём десятилетнем опросе критиков и 12-м величайшим фильмом всех времён в своём опрос", "sources_count": 1, "entities": ["Джона Хинкли-младшего", "Джоди Фостер, Сибилл", "Альберт Брукс", "Пола Шредера. Действие", "Бернард Херрманн", "Рональда Рейгана", "Трэвиса Бикла,", "Шеперд, Харви Кейтель,", "Линдоном». В", "Вьетнаме. Роберт Де", "Мартином Скорсезе", "Taxi Driver)", "Библиотекой Конгресса США", "Columbia Pictures", "Питер Бойл, Леонард"]}