{"content": "Три́ллер (англицизм от англ. thriller; от thrill — «трепет», «волнение») или остросюжетный фильм — жанр произведений литературы, кино, и видеоигр, нацеленный вызвать у зрителя или читателя чувства тревожного ожидания («саспенса»), волнения или страха. Жанр не имеет чётких границ, элементы триллера присутствуют во многих произведениях других жанров. В кинематографе к триллерам зачастую относят детективные и шпионские фильмы, фильмы ужасов, приключенческие фильмы, а также боевики. В видеоиграх жанр сочетает стелс-экшены, интерактивные приключения, хорроры, выживания, квесты, психологические драмы.\n\nTrillian — программа-мессенджер для Windows, macOS, Apple iOS, BlackBerry и Android, созданная компанией Cerulean Studios. Поддерживает многие распространённые протоколы обмена мгновенными сообщениями, такие как AIM, Windows Live Messenger, Yahoo! Messenger, IRC, Bonjour, Jabber и др.\nСамой ранней версией мессенджера была 0.50; она распространялась бесплатно как простой IRC-клиент, однако с версии Trillian Pro 1.0 до Trillian Astra Pro 4.2 программа была условно-платной. Cerulean Studios предлагало 2 версии программы: Trillian (Astra) Free и Trillian (Astra) Pro. Версия Free являлась бесплатной, но в ней отсутствовали некоторые функции, доступные в платной версии Pro.\nНачиная с версии 5 Trillian снова стал бесплатным. Однако существует возможность купить лицензию, которая позволяет обращаться в техническую поддержку, убирает рекламные баннеры и даёт возможность сохранять историю переписки в «облаке» на сервере разработчиков.\nПрограмма получила своё название в честь Триши Макмиллиан (Триллиан) — вымышленного персонажа из юмористических научно-фантастических романов Дугласа Адамса «Автостопом по галактике».\n\nThe trillers are a group of passerine birds belonging to the cuckooshrike family Campephagidae partially making up the genus  Lalage. Their name come from the loud trilling calls of the males. There are about 12 species that usually exist in southern Asia and Australasia ", "sources_count": 3, "entities": ["Trillian Astra Pro", "IRC, Bonjour, Jabber", "Messenger, Yahoo! Messenger,", "Pro. Версия Free", "Cerulean Studios", "Pro. Начиная", "Cerulean Studios. Поддерживает", "Дугласа Адамса", "Триши Макмиллиан", "Trillian Pro", "AIM, Windows Live", "Lalage. Their", "Norfolk Island"]}