{"content": "Фанта́стика (от др.-греч. φανταστική — искусство воображения, фантазия) — жанр, или творческий метод, или приём, или область художественной литературы, кино, изобразительного и других форм искусств, характеризуемый использованием фантастического допущения, «элемента необычайного»; нарушением границ реальности, нарушением принятой в тексте нормы условности; изображением фактов, которые с точки зрения характерных для данной культуры представлений не просто не существуют или не существовали, но и не могли существовать, поскольку в реальной действительности вообще не существует фактов данного типа (данной категории), причём такое нарушение преднамеренно. Фантастика и художественный вымысел различаются между собой тем, что автор, создающий художественное произведение, придумывает необычные индивидуальные факты, а автор, создающий фантастику, вводит в действие также целые несуществующие категории (см. Вторичная условность). Современная фантастика включает в себя такие жанры, как научная фантастика, фэнтези, альтернативная история, киберпанк и многие другие.\nВыделение фантастики как особого литературного метода может критиковаться, поскольку фантастика встречается в рамках самых различных литературных методов — романтизма, реализма, модернизма и др. С этой точки зрения речь идёт не о методе, а о двух противоположных тенденциях, характерных для искусства в целом: тенденции к воссозданию действительности и к пересозданию её. Фантастика в большей мере тяготеет к второй из этих тенденций, но при создании самих фантастических образов, как правило, наблюдается взаимодействие обеих тенденций. Существует понятие «жизнеподобие», противопоставляемое таким формам условности, как фантастика, гипербола, гротеск и др. Выделение фантастики как жанра тоже порой критикуется, поскольку фантастика в литературе очень разнообразна по родам, видам и жанрам (может включать в себя психологическую новеллу, политический памфлет, философскую драму, сказочную повесть и др.).\nНесмотря на разнообразие ", "sources_count": 2, "entities": ["Fantastic Four", "Джонатан Хикман. Fantastic", "Рой Томас, Джон", "Симонсон, Том ДеФалко,", "Marvel Comics,", "Marvel Comics", "Михаил Бахтин", "Стэн Ли", "Бушема, Джон Бирн,", "Fantastic Four,", "Марк Уэйд", "Джек Кирби),", "Marvel Comics, Fantastic", "Стив Энглхарт, Уолт"]}